{
  "total_stories": 13,
  "competencies": [
    "Communication",
    "Cross-Functional Collaboration",
    "Data Analysis",
    "Decision Making",
    "Market Research",
    "Negotiation",
    "Problem Solving",
    "Resource Management",
    "Stakeholder Management",
    "adaptability",
    "analytical thinking",
    "collaboration",
    "communication",
    "crisis_management",
    "cross-functional collaboration",
    "cultural adaptability",
    "culture_building",
    "customer-centricity",
    "data_analysis",
    "emotional_intelligence",
    "empathy",
    "employee_engagement",
    "growth",
    "innovation",
    "international",
    "leadership",
    "market analysis",
    "marketing_strategy",
    "mentorship",
    "negotiation",
    "product_management",
    "relationship building",
    "relationship_management",
    "stakeholder management",
    "strategic planning",
    "strategic thinking",
    "strategic_planning",
    "strategic_thinking",
    "team_building",
    "team_collaboration",
    "technical",
    "user_experience_design",
    "visionary thinking"
  ],
  "companies": [
    "Appier",
    "BotBonnie"
  ],
  "timeframes": [
    [
      2016,
      2021
    ],
    [
      2017
    ],
    [
      2018
    ],
    [
      2019
    ],
    [
      2019,
      2021
    ],
    [
      2020
    ],
    [
      2021
    ],
    [
      2021
    ],
    [
      2021,
      2024
    ],
    [
      2022
    ],
    [
      2022
    ],
    [
      2022,
      2023
    ],
    [
      2022,
      2024
    ]
  ],
  "seniority_levels": {
    "executive": 13
  },
  "impact_levels": {
    "high": 8,
    "medium": 5
  },
  "last_updated": "2025-08-05T04:25:47.678Z",
  "processing_summary": {
    "stories_by_category": {
      "leadership": [
        {
          "title": "Staying Focused When Everything Feels Important",
          "summary": "By balancing impact, urgency, dependencies, and strategic goals, I successfully led multiple product initiatives at Appier — including an LLM Copilot and onboarding-focused features — while keeping stakeholders aligned and outcomes prioritized.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2021,
            2024
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "Communication",
            "Resource Management",
            "Decision Making",
            "Problem Solving"
          ],
          "interviewCategories": [
            "Leadership",
            "Project Management",
            "Strategic Thinking",
            "Stakeholder Management",
            "Prioritization"
          ],
          "questionTypes": [
            "Describe a time when you had to manage multiple priorities.",
            "How do you ensure alignment among stakeholders?",
            "Can you give an example of how you prioritized tasks in a project?",
            "What strategies do you use to manage dependencies in product development?",
            "Tell me about a time you had to make a tough decision regarding project priorities."
          ],
          "metrics": [],
          "keywords": [
            "impact",
            "projects",
            "once",
            "prioritize",
            "dependencies",
            "also",
            "copilot",
            "moved",
            "managing",
            "multiple",
            "using",
            "urgency",
            "strategic",
            "alignment",
            "example"
          ],
          "starStructure": {
            "situation": "When I’m managing multiple projects at once, I prioritize using a mix of **impact, urgency, dependencies, and strategic alignment**.",
            "task": "To prioritize, I first aligned with leadership on the **non-negotiables** — for instance, a quarterly goal tied to increasing onboarding conversion had to be met",
            "actions": [],
            "results": []
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "When I’m managing multiple projects at once, I prioritize using a mix of **impact, urgency, dependencies, and strategic alignment**.\n\nFor example, at Appier, I was leading two product lines — one for marketing automation, the other for chatbot engagement — while also prototyping a new LLM-based Copilot.\n\nTo prioritize, I first aligned with leadership on the **non-negotiables** — for instance, a quarterly goal tied to increasing onboarding conversion had to be met. That made the Journey Map Builder a top priority.\n\nThen I looked at **dependencies** — one feature blocked engineering work for another team, so I moved it up to avoid bottlenecks. I also reviewed **effort vs. impact**: some projects sounded exciting, like the LLM Copilot, but could be built as MVPs in two weeks to test demand.\n\nFinally, I communicated openly with stakeholders to set expectations, and reallocated resources or paused lower-impact items.\n\nThis helped me stay focused on what truly moved the needle, rather than trying to do everything at once.",
          "slug": "2025-08-03-staying-focused-when-everything-feels-important"
        },
        {
          "title": "The Cost of One Bad Hire: A Painful Lesson in Team Building",
          "summary": "A rushed hiring decision during a critical client engagement with Audi taught me that even one misaligned hire can damage team morale and trust, shaping how I approach hiring and culture-building ever since.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2018
          ],
          "competencies": [
            "leadership",
            "product_management",
            "crisis_management",
            "culture_building",
            "emotional_intelligence",
            "strategic_thinking",
            "adaptability",
            "team_building",
            "communication"
          ],
          "interviewCategories": [
            "Decision Making",
            "Team Dynamics",
            "Conflict Resolution",
            "Cultural Fit",
            "Leadership Challenges"
          ],
          "questionTypes": [
            "Describe a time when you made a hiring mistake and what you learned from it.",
            "How do you assess cultural fit during the hiring process?",
            "Can you provide an example of how a team member's behavior affected team morale?",
            "What strategies do you use to ensure team alignment and trust?",
            "Tell me about a time you had to manage a difficult situation with a client."
          ],
          "metrics": [],
          "keywords": [
            "team",
            "work",
            "most",
            "audi",
            "pressure",
            "project",
            "high",
            "strong",
            "experience",
            "culture",
            "result",
            "hiring",
            "painful",
            "valuable",
            "failures"
          ],
          "starStructure": {
            "situation": "One of the most painful but valuable failures in my career happened during the early days of BotBonnie.",
            "task": "Eventually, I had to let him go and personally explain the situation to Audi — which was not easy",
            "actions": [],
            "results": []
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "One of the most painful but valuable failures in my career happened during the early days of BotBonnie.\n\nWe were growing fast, had just launched several successful campaigns, and were about to work with a major client — Audi. Under pressure, I urgently needed a project manager to help manage this high-stakes engagement.\n\nWe found a candidate with a strong academic background and banking project management experience. While I noticed a slight mismatch in mindset and culture fit, I ignored my instinct due to time pressure and hired him.\n\nUnfortunately, the result was disastrous. His work was often sloppy, he resisted feedback, and his confrontational attitude disrupted team morale. Over three months, his presence negatively affected the team to the point where we two originally strong members were started to work like him. Eventually, I had to let him go and personally explain the situation to Audi — which was not easy.\n\nThat experience taught me a critical lesson: **in a startup, one bad hire can cost you far more than just productivity — it can affect team culture, trust, and momentum.**\n\nSince then, I’ve treated hiring as one of the most important decisions a founder makes. I invested in a more structured hiring process, involving team fit interviews, values alignment, and trial tasks. As a result, we gradually built a high-performing team that truly shared our vision.",
          "slug": "2025-08-03-the-cost-of-one-bad-hire-a-painful-lesson-in-team-building"
        },
        {
          "title": "Unifying the Customer Journey: From Siloed Tools to Seamless Platform",
          "summary": "Without formal authority, I led a company-wide transformation to unify Appier’s product suite, launching a successful MVP that reversed churn, secured executive buy-in, and reshaped the long-term product architecture.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022,
            2023
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "crisis_management",
            "growth",
            "technical",
            "stakeholder management",
            "customer-centricity",
            "communication",
            "negotiation",
            "visionary thinking"
          ],
          "interviewCategories": [
            "Leadership",
            "Problem Solving",
            "Collaboration",
            "Adaptability",
            "Strategic Thinking"
          ],
          "questionTypes": [
            "Describe a time you led a project without formal authority.",
            "How did you handle resistance when proposing a new initiative?",
            "Can you give an example of how you identified and addressed a customer pain point?",
            "What steps did you take to align cross-functional teams on a vision?",
            "How did you measure the success of your initiative?"
          ],
          "metrics": [
            "$300K",
            "in 3 months",
            "3",
            "15",
            "300"
          ],
          "keywords": [
            "data",
            "product",
            "botbonnie",
            "sales",
            "cloud",
            "clients",
            "across",
            "vision",
            "over",
            "three",
            "company",
            "months",
            "after",
            "appier",
            "cross"
          ],
          "starStructure": {
            "situation": "After Appier acquired my startup BotBonnie, I began sitting in on cross-functional sales pitches and noticed a recurring issue: while we marketed an end-to-end marketing solution, our products were siloed. Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie. This created a huge gap between what we promised and what we delivered—leading to poor product experience and low renewal intent.",
            "task": "Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie",
            "actions": [],
            "results": [
              "$300K",
              "in 3 months",
              "3",
              "15",
              "300"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "After Appier acquired my startup BotBonnie, I began sitting in on cross-functional sales pitches and noticed a recurring issue: while we marketed an end-to-end marketing solution, our products were siloed. Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie. This created a huge gap between what we promised and what we delivered—leading to poor product experience and low renewal intent.\n\nAt the same time, I saw a clear industry trend: brands were looking to unify first-party data and deliver personalized experiences across all channels—EDM, SMS, Web, App, and messaging platforms like LINE and WhatsApp. Appier had all the ingredients, but no one was owning the unification vision.\n\nAt the time, I was leading only the BotBonnie product line, with no authority over the other three product teams. Still, I felt responsible for fixing the fragmented user experience. My challenge was to build alignment across product, sales, and executive stakeholders—without formal ownership—and propose a vision that could influence company-wide roadmap and resources.\n\nFirst, I conducted over a dozen customer interviews and internal sessions with sales and customer success leaders to validate the pain points. I synthesized the findings into a three-year platform integration proposal that divided our products into two strategic pillars: **Personalization Cloud** (front-end orchestration) and **Data Cloud** (backend pipelines).\n\nI anticipated pushback around timing and resources, so I proposed a low-risk MVP: a **“Journey Map Builder”** that we could ship in 3 months using only my team. It offered clients a unified UI to design omnichannel campaigns and showcased what integration could look like.\n\nBefore going to the CEO, I aligned with our Chief Strategy Officer—incorporating his feedback and securing early buy-in. When I finally pitched to the CEO, I led with direct client quotes, market data, and a clear plan to phase the vision over time.\n\nThe CEO approved the plan in 15 minutes—and used my slides the next day at our company AMA. I was given cross-product authority to lead the initiative. Three months later, we launched the MVP, recovered **$300K ARR** from churn-risk clients, and received overwhelming feedback from sales and design teams.\n\nSix months later, I was promoted to **Senior Director**, overseeing both BotBonnie and AIQUA. Even after I left, the company continued to build on the same platform architecture I initiated—formally structuring the org around **Personalization Cloud** and **Data Cloud**.",
          "slug": "2025-08-03-unifying-the-customer-journey-from-siloed-tools-to-seamless-platform"
        },
        {
          "title": "Balancing Principles and Diplomacy in Cross-Regional Alignment",
          "summary": "When a roadmap disagreement escalated to the CEO, I resolved the tension by empathizing with regional priorities, offering a collaborative compromise, and preserving both strategic focus and team trust.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022
          ],
          "competencies": [
            "leadership",
            "product_management",
            "international",
            "empathy",
            "negotiation",
            "strategic thinking",
            "communication"
          ],
          "interviewCategories": [
            "Conflict Resolution",
            "Leadership",
            "Collaboration",
            "Stakeholder Management"
          ],
          "questionTypes": [
            "Describe a time you resolved a conflict within your team.",
            "How do you balance competing priorities from different stakeholders?",
            "Can you give an example of how you handled a disagreement with a superior?",
            "What strategies do you use to maintain team trust during challenging situations?"
          ],
          "metrics": [],
          "keywords": [
            "korea",
            "product",
            "sales",
            "leader",
            "strategy",
            "markets",
            "however",
            "roadmap",
            "quarter",
            "wasn",
            "business",
            "leadership",
            "about",
            "disagreement",
            "manager"
          ],
          "starStructure": {
            "situation": "One time I had a disagreement with my manager was at Appier, when I was leading product strategy across multiple regional markets.",
            "task": "",
            "actions": [],
            "results": []
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "One time I had a disagreement with my manager was at Appier, when I was leading product strategy across multiple regional markets.\n\nOur Korea sales leader was pushing hard to prioritize a product request for the Korean market. However, based on our existing roadmap and engineering capacity, I had already communicated — both to him and our CEO — that this would need to wait until the following quarter. The prioritization wasn’t arbitrary; it was aligned with overall business goals and agreed upon with leadership.\n\nHowever, the sales leader felt I was deprioritizing Korea and escalated the issue to the CEO, who then asked me to apologize and try to resolve the situation.\n\nI was initially very frustrated — from my perspective, I had been transparent and collaborative the whole time. I also worried that this would set a precedent that complaints could override product strategy.\n\nBut after cooling down, I tried to understand the bigger picture. The CEO wasn’t necessarily questioning my decision-making, but wanted to maintain momentum in Korea, which was one of our most promising markets.\n\nSo I proactively scheduled a call with the Korea sales leader. I acknowledged the misalignment in expectations, explained the roadmap again, and offered a compromise: we’d begin the **requirement scoping process early**, and **join any client-facing meetings** to support their pitches.\n\nThis helped rebuild trust, and Korea went on to deliver strong sales that quarter — even before the product was fully delivered.\n\nIt reminded me that sometimes leadership isn’t about being right — it’s about **balancing principles with diplomacy**, and finding solutions that move the business forward.",
          "slug": "2025-08-04-balancing-principles-and-diplomacy-in-cross-regional-alignment"
        },
        {
          "title": "Betting on Instagram: A Strategic Pivot for Market Entry",
          "summary": "By challenging the original roadmap and leading a rapid pivot to Instagram Messaging automation, I enabled a differentiated go-to-market strategy in Japan that won enterprise deals and positioned us as an early mover.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2021
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "growth",
            "technical",
            "Data Analysis",
            "Market Research",
            "Stakeholder Management",
            "Negotiation",
            "Cross-Functional Collaboration"
          ],
          "interviewCategories": [
            "Leadership",
            "Strategic Thinking",
            "Problem Solving",
            "Adaptability",
            "Innovation"
          ],
          "questionTypes": [
            "Describe a time you had to pivot a project strategy.",
            "How do you approach data-driven decision making?",
            "Can you give an example of how you led a team through a significant change?",
            "What steps do you take to evaluate market opportunities?",
            "How do you handle competing priorities in product management?"
          ],
          "metrics": [
            "50"
          ],
          "keywords": [
            "instagram",
            "japan",
            "automation",
            "market",
            "product",
            "messaging",
            "whether",
            "integration",
            "pivot",
            "sales",
            "deals",
            "launch",
            "month",
            "within",
            "enterprise"
          ],
          "starStructure": {
            "situation": "When Facebook released the Instagram Messaging API, we were debating whether to pause our ongoing product roadmap to prioritize Instagram automation. Our CEO preferred focusing on cross-product integration to support expansion in Japan.",
            "task": "",
            "actions": [],
            "results": [
              "50"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "When Facebook released the Instagram Messaging API, we were debating whether to pause our ongoing product roadmap to prioritize Instagram automation. Our CEO preferred focusing on cross-product integration to support expansion in Japan.\n\nAs the product lead, I wanted to evaluate whether reprioritizing to Instagram would be a smarter strategic move—and if so, convince leadership to pivot the plan.\n\nI gathered data from multiple sources:\n\n*   Market reports showed Instagram had 50% market penetration in Japan—behind only LINE and YouTube\n    \n*   Internal sales call notes revealed we were losing deals in Japan to pricing competition, with little differentiation\n    \n*   No competitors were offering Instagram Messaging-based automation yet\n    \n*   Our engineers estimated we could launch an MVP in under one month\n    \n\nI synthesized these insights and proposed a shift in focus—launch Instagram automation first to create a differentiated market entry strategy, and use that traction to expand into broader platform integration later.\n\nThe CEO agreed to pivot. Within a month, we launched three marketing automation scenarios for Instagram and enabled the Japan sales team to go to market with something truly novel. The feedback was very positive—enterprise clients were excited to test new engagement strategies. Within a few months, we closed several key enterprise deals, establishing BotBonnie as an early mover in Japan.",
          "slug": "2025-08-04-betting-on-instagram-a-strategic-pivot-for-market-entry"
        },
        {
          "title": "Bridging Cultures to Deliver Under Pressure",
          "summary": "Faced with timeline conflict on a cross-functional MVP, I defused tension by aligning personal incentives, reshaping scope, and building trust—resulting in on-time delivery, $300K in recovered revenue, and stronger cross-team collaboration.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "crisis_management",
            "growth",
            "technical",
            "empathy",
            "negotiation",
            "communication",
            "strategic thinking",
            "relationship building"
          ],
          "interviewCategories": [
            "Conflict Resolution",
            "Team Collaboration",
            "Leadership",
            "Adaptability",
            "Stakeholder Management"
          ],
          "questionTypes": [
            "Describe a time you resolved a conflict within a team.",
            "How do you handle tight deadlines with cross-functional teams?",
            "Can you provide an example of how you aligned team members with different perspectives?",
            "What strategies do you use to build trust among team members?",
            "Tell me about a time you had to adapt your approach to meet project goals."
          ],
          "metrics": [
            "$300K",
            "3",
            "2",
            "300"
          ],
          "keywords": [
            "team",
            "product",
            "estimates",
            "during",
            "strong",
            "shared",
            "about",
            "cross",
            "engineers",
            "different",
            "lines",
            "botbonnie",
            "tight",
            "three",
            "deadline"
          ],
          "starStructure": {
            "situation": "When I led the MVP development of Journey Map at Appier, I formed a new cross-functional team with engineers from two different product lines—BotBonnie (my original team) and another internal product group. We had a tight three-month deadline. The engineering manager and I had broken down the MVP scope into tasks and asked each engineer to estimate their time.",
            "task": "",
            "actions": [],
            "results": [
              "$300K",
              "3",
              "2",
              "300"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "When I led the MVP development of Journey Map at Appier, I formed a new cross-functional team with engineers from two different product lines—BotBonnie (my original team) and another internal product group. We had a tight three-month deadline. The engineering manager and I had broken down the MVP scope into tasks and asked each engineer to estimate their time.\n\nWhile the BotBonnie engineers gave estimates in line with expectations, one engineer from the other team estimated timelines that were 3x longer for tasks of similar complexity. During the planning meeting, he openly criticized the timeline as unrealistic and voiced strong resistance. This was more than just a difference in estimates—it revealed deeper cultural misalignment between teams.\n\nI first acknowledged his concerns and paused the meeting, promising to reassess the scope and timelines. The next day, I invited him to lunch outside office to understand his perspective.\n\nThrough the conversation, I learned his performance was evaluated heavily based on delivery completeness, lack of bugs, and timely execution—which made him risk-averse under our tight deadline. He worried that speed would come at the cost of quality.\n\nI shared the broader purpose of this MVP: to validate a new cross-product vision, demonstrate our ability to move fast, and rebuild trust with our executive team and customers. I emphasized that this was not about perfection, but velocity and iteration.\n\nTo support him, I made three commitments:\n\n1.  I spoke with his manager to align on performance criteria and assured him that I would take responsibility for risks during pilot testing.\n    \n2.  We re-scoped the MVP to separate “must-haves” from “nice-to-haves,” balancing ambition with feasibility.\n    \n3.  I promised to amplify the team’s impact and visibility, so their effort would be recognized beyond just delivery.\n    \n\nIn return, he agreed to re-evaluate the estimates with this new context and became an enthusiastic contributor to the team.\n\nWe successfully launched the MVP on time. During the beta phase, we recovered over $300K in ARR from churn-risk clients. Many leaders in the company, initially skeptical of our timeline, became strong supporters. I was later promoted to lead both product lines and continued scaling the platform.\n\nThis experience taught me that resolving conflict isn’t about “winning”—it’s about understanding what drives the other person and co-creating a shared goal.\n\nIt also reinforced my belief that building a high-performing team across different cultures requires more than just processes—it requires shared goals, psychological safety, and strong personal alignment.",
          "slug": "2025-08-04-bridging-cultures-to-deliver-under-pressure"
        },
        {
          "title": "Designing for the “Aha” Moment in Onboarding",
          "summary": "By streamlining onboarding into a goal-driven, in-flow experience, I increased chatbot publication by 20% and helped users reach product value faster—boosting both activation and retention.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2020
          ],
          "competencies": [
            "product_management",
            "growth",
            "technical",
            "culture_building",
            "data_analysis",
            "user_experience_design",
            "strategic_planning",
            "collaboration"
          ],
          "interviewCategories": [
            "Problem Solving",
            "Leadership",
            "Innovation",
            "User Experience"
          ],
          "questionTypes": [
            "Describe a time when you improved a process.",
            "How do you approach user feedback in product design?",
            "Can you give an example of a successful A/B test you conducted?",
            "What strategies do you use to enhance user engagement?"
          ],
          "metrics": [
            "20% increase",
            "20"
          ],
          "keywords": [
            "users",
            "onboarding",
            "flow",
            "steps",
            "published",
            "drop",
            "test",
            "registration",
            "botbonnie",
            "trying",
            "grow",
            "north",
            "star",
            "metric",
            "number"
          ],
          "starStructure": {
            "situation": "At BotBonnie, we were trying to grow our North Star metric: the number of active chatbots published on the platform. We believed that if users quickly got into our visual no-code builder and started creating flows, they would hit their “aha” moment and stick around.",
            "task": "We needed to improve this flow to boost activation and retention",
            "actions": [],
            "results": [
              "20% increase",
              "20"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "At BotBonnie, we were trying to grow our North Star metric: the number of active chatbots published on the platform. We believed that if users quickly got into our visual no-code builder and started creating flows, they would hit their “aha” moment and stick around.\n\nHowever, data from our onboarding funnel showed a sharp drop-off—many users were not completing key steps like designing a flow or connecting to messaging channels like Facebook or LINE. Most never published a bot. We needed to improve this flow to boost activation and retention.\n\nWe revisited our onboarding design and ran an A/B test.\n\nIn the new version, instead of having users go through multiple steps across different pages, we guided them to create a simple bot right inside the registration flow. They could select a channel, test the conversation, and publish—all within one screen and under three clicks per step.\n\nAlthough it slightly increased time spent in onboarding, the steps felt more goal-oriented and provided quicker feedback.\n\nThe new onboarding flow led to a 20% increase in bot publication, with no drop in registration completion. It was a small but high-leverage improvement that helped more users reach meaningful product value faster.",
          "slug": "2025-08-04-designing-for-the-aha-moment-in-onboarding"
        },
        {
          "title": "From Engineer to Enterprise Leader: The Journey Behind BotBonnie",
          "summary": "Building BotBonnie from scratch to $2M ARR and seeing it acquired was a milestone, but the real success was growing into a strategic leader who shaped product vision, built lasting teams, and created long-term impact across markets.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2016,
            2021
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "growth",
            "international",
            "strategic planning",
            "cross-functional collaboration",
            "market analysis",
            "cultural adaptability",
            "mentorship"
          ],
          "interviewCategories": [
            "Leadership",
            "Teamwork",
            "Adaptability",
            "Strategic Thinking",
            "Problem Solving"
          ],
          "questionTypes": [
            "Can you describe a time when you had to lead a team through a significant change?",
            "How do you approach building a product that meets market needs?",
            "What strategies do you use to foster team growth and development?",
            "Describe a challenging situation you faced during your tenure and how you overcame it.",
            "How do you balance technical skills with leadership responsibilities?"
          ],
          "metrics": [
            "$2M",
            "2M ARR",
            "2"
          ],
          "keywords": [
            "being",
            "team",
            "building",
            "botbonnie",
            "product",
            "appier",
            "through",
            "acquisition",
            "leadership",
            "most",
            "started",
            "still",
            "helped",
            "company",
            "part"
          ],
          "starStructure": {
            "situation": "My greatest professional success so far is building BotBonnie from the ground up, scaling it to $2M ARR, and eventually joining Appier through acquisition. But more than the business result, it’s the personal transformation and leadership growth that I’m most proud of.",
            "task": "I had to identify the right product-market fit, navigate competition, pitch investors and clients, and lead a cross-functional team through both failures and breakthroughs",
            "actions": [],
            "results": [
              "$2M",
              "2M ARR",
              "2"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "My greatest professional success so far is building BotBonnie from the ground up, scaling it to $2M ARR, and eventually joining Appier through acquisition. But more than the business result, it’s the personal transformation and leadership growth that I’m most proud of.\n\nWhen we started BotBonnie, I was still very much an engineer at heart—I loved building things. But as we grew, I realized that being a founder meant shifting from being a maker to being a strategist, team builder, and communicator.\n\nI had to identify the right product-market fit, navigate competition, pitch investors and clients, and lead a cross-functional team through both failures and breakthroughs.\n\nAfter being acquired by Appier, I stayed on and helped integrate BotBonnie into a broader enterprise suite. That came with its own set of challenges: adapting to a different company culture, building credibility internally, and helping my team thrive in a new environment. Over time, I earned the trust to drive platform strategy across two product lines, and helped scale the solution into markets like Japan and Korea.\n\nLooking back, the most meaningful part isn’t the acquisition or the ARR. It’s seeing team members grow into new leadership roles, seeing our product evolve into part of a public company’s long-term roadmap, and knowing that the vision we started with is still creating value years later.",
          "slug": "2025-08-04-from-engineer-to-enterprise-leader-the-journey-behind-botbonnie"
        },
        {
          "title": "Managing Risk Through Empathy and Alignment",
          "summary": "By uncovering the root of team resistance and aligning expectations across functions, I kept our high-stakes MVP on track—delivering on time, recovering $300K in ARR, and strengthening team cohesion.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022,
            2024
          ],
          "competencies": [
            "leadership",
            "product_management",
            "growth",
            "culture_building",
            "empathy",
            "communication",
            "stakeholder management",
            "strategic thinking",
            "adaptability"
          ],
          "interviewCategories": [
            "Leadership",
            "Conflict Resolution",
            "Team Collaboration",
            "Risk Management",
            "Change Management"
          ],
          "questionTypes": [
            "Describe a time when you had to manage a conflict within a team.",
            "How do you handle resistance from team members?",
            "Can you give an example of how you aligned a cross-functional team towards a common goal?",
            "What strategies do you use to manage project risks?",
            "Tell me about a time you had to deliver a project under a tight deadline."
          ],
          "metrics": [
            "$300K",
            "within 3 months",
            "3",
            "300"
          ],
          "keywords": [
            "team",
            "risk",
            "timeline",
            "quality",
            "impact",
            "leading",
            "cross",
            "functional",
            "deliver",
            "journey",
            "within",
            "months",
            "included",
            "engineers",
            "different"
          ],
          "starStructure": {
            "situation": "I was leading a cross-functional team to deliver the MVP of Journey Map within 3 months. The team included engineers from two very different product lines, each with their own working culture.",
            "task": "",
            "actions": [],
            "results": [
              "$300K",
              "within 3 months",
              "3",
              "300"
            ]
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "I was leading a cross-functional team to deliver the MVP of Journey Map within 3 months. The team included engineers from two very different product lines, each with their own working culture.\n\nEarly in planning, we encountered a major risk. One engineer estimated timelines that were 3x longer than others for similar tasks. He believed the timeline was unrealistic and feared it would compromise code quality—due to how his performance was measured, he was hesitant to cut corners or move fast.\n\nI identified several risks: timeline delays, quality issues, team morale, and internal credibility.\n\nTo address them, I:\n\n*   Took the time to understand the root cause behind his resistance by having a one-on-one lunch\n    \n*   Re-scoped the MVP to distinguish “must-have” and “nice-to-have” features\n    \n*   Spoke directly with his manager to align on evaluation expectations and assured I would take ownership of pilot-phase bugs\n    \n*   Reframed the goal of this MVP to focus on iteration speed and customer impact, not perfection\n    \n*   Positioned the project as high-impact to increase recognition and motivation across the team\n    \n\nWe launched the MVP on time, recovered $300K in ARR from churn-risk customers, and earned strong support from execs who were initially skeptical.\n\nThe experience taught me that effective risk management requires not just tactical mitigation, but also empathy, communication, and cultural alignment.",
          "slug": "2025-08-04-managing-risk-through-empathy-and-alignment"
        },
        {
          "title": "Turning a Crisis into a Catalyst for Product Growth",
          "summary": "When a major campaign nearly became a PR disaster, I led a rapid response that uncovered systemic issues, turned a furious client into a success story, and sparked lasting improvements in product design, support, and retention.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2017
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "growth",
            "technical",
            "empathy",
            "communication",
            "analytical thinking",
            "strategic planning",
            "collaboration"
          ],
          "interviewCategories": [
            "Crisis Management",
            "Customer Service",
            "Product Development",
            "Leadership",
            "Problem Solving"
          ],
          "questionTypes": [
            "Describe a time you turned a negative customer experience into a positive outcome.",
            "How do you handle high-pressure situations with clients?",
            "Can you give an example of how you identified and solved a systemic issue?",
            "What steps do you take to ensure customer satisfaction during a crisis?",
            "How do you prioritize tasks when addressing urgent client concerns?"
          ],
          "metrics": [
            "2017",
            "2",
            "3",
            "4"
          ],
          "keywords": [
            "client",
            "high",
            "product",
            "most",
            "chatbot",
            "design",
            "after",
            "user",
            "profile",
            "clients",
            "platform",
            "launch",
            "campaign",
            "success",
            "stories"
          ],
          "starStructure": {
            "situation": "In 2017, one of our most high-profile brand clients used our chatbot platform to launch a major Messenger campaign. They invested significant time and budget into the design and had high expectations, especially after seeing our previous success stories.",
            "task": "As co-founder, I had to address their frustration, uncover the root cause, and prevent churn or reputational damage",
            "actions": [],
            "results": [
              "2017",
              "2",
              "3",
              "4"
            ]
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "In 2017, one of our most high-profile brand clients used our chatbot platform to launch a major Messenger campaign. They invested significant time and budget into the design and had high expectations, especially after seeing our previous success stories.\n\nThree days after launch, the client was furious. The campaign had far fewer user completions than expected. Most users dropped off after the first few messages, and the client claimed the product was misleading and poorly designed. They threatened to publicly discredit us and demanded compensation. As co-founder, I had to address their frustration, uncover the root cause, and prevent churn or reputational damage.\n\nFirst, I responded personally to acknowledge their disappointment, assured them we were taking this seriously, and immediately assigned our CS team to engage directly with the client. I also formed a small task-force team—myself, a PM, and an engineer—to investigate user behavior data.\n\nWithin a few hours, we found that poor conversation design caused user confusion and high drop-off. The core issues were:\n\n*   The client lacked guidance and didn’t know the best practice on how to structure a decision-tree chatbot.\n    \n*   Our product dashboard only reported final results, making it hard to detect UX bottlenecks.\n    \n*   Our internal systems didn’t flag high-profile clients using the self-service platform, so CS hadn’t proactively supported them.\n    \n\nThe next day, I made several decisions:\n\n1.  We created and promoted educational content on conversation design best practices across our customer channels.\n    \n2.  We ideated a heatmap-style visualization tool to help identify drop-off points in chatbot flows.\n    \n3.  We enhanced our internal dashboard to automatically flag high-value self-service accounts, enabling proactive CS outreach.\n    \n4.  I called the client directly to explain the findings, offered CS assistance to rebuild their flow, and shared our roadmap to address the gaps.\n    \n\nWhat started as a potential PR disaster turned into a long-term partnership. The client appreciated our transparency and follow-through, stayed with us, and later became one of our public success stories. Internally, the heatmap and account detection tools became key features that improved product quality and customer retention.\n\nThis experience taught me that difficult customers are often your most valuable. Their frustration is rarely random—it’s a signal that something deeper is broken. By responding with empathy, moving quickly, and thinking systemically, we not only saved the account but improved the product for everyone.",
          "slug": "2025-08-04-turning-a-crisis-into-a-catalyst-for-product-growth"
        },
        {
          "title": "Building Company Culture from Ground Up",
          "summary": "How I transformed BotBonnie's culture from a vague concept to defined values that achieved 90% retention",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2019,
            2021
          ],
          "competencies": [
            "leadership",
            "product_management",
            "crisis_management",
            "growth",
            "culture_building",
            "strategic_planning",
            "employee_engagement",
            "communication",
            "collaboration",
            "innovation"
          ],
          "interviewCategories": [
            "Leadership and Management",
            "Team Dynamics",
            "Cultural Fit",
            "Problem Solving",
            "Change Management"
          ],
          "questionTypes": [
            "Describe a time you faced a cultural challenge in your team.",
            "How do you approach building a positive company culture?",
            "Can you provide an example of how you improved team morale?",
            "What strategies have you used to retain employees?",
            "How do you handle feedback from team members regarding culture?"
          ],
          "metrics": [
            "8 team members",
            "18 people",
            "2",
            "8",
            "15",
            "20",
            "3",
            "4",
            "5",
            "6"
          ],
          "keywords": [
            "culture",
            "team",
            "company",
            "sessions",
            "grew",
            "morale",
            "work",
            "together",
            "results",
            "botbonnie",
            "members",
            "problem",
            "teammate",
            "directly",
            "needed"
          ],
          "starStructure": {
            "situation": "When BotBonnie grew from 2 founders to 8 team members, I realized we had a culture problem. During a one-on-one, a usually quiet teammate asked me directly: \"What is BotBonnie's company culture?\" I didn't have a good answer, and I could see that morale was declining. That teammate eventually left, which was a wake-up call that I needed to be intentional about culture.\n\nAt that time, the overall morale hit a low point. I even started questioning the meaning of my own work. Company culture became an unsolvable puzzle in my mind, something like an NP-hard problem, as us nerdy engineers would say.",
            "task": "I needed to define and build an authentic company culture that would:\n\n*   Improve team retention and morale\n*   Create shared values and working principles\n*   Scale with our growing team\n*   Actually impact performance, not just be abstract concepts",
            "actions": [],
            "results": [
              "%+ annual employee retention** in a high-churn market",
              "/100 score** in company-wide leadership survey",
              "core values defined** through collaborative process:",
              "Freedom with responsibility",
              "Energetic and joyful work",
              "Creativity",
              "Flexibility and openness to change",
              "Willingness to share"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "# The Challenge\n\nWhen BotBonnie grew from 2 founders to 8 team members, I realized we had a culture problem. During a one-on-one, a usually quiet teammate asked me directly: \"What is BotBonnie's company culture?\" I didn't have a good answer, and I could see that morale was declining. That teammate eventually left, which was a wake-up call that I needed to be intentional about culture.\n\nAt that time, the overall morale hit a low point. I even started questioning the meaning of my own work. Company culture became an unsolvable puzzle in my mind, something like an NP-hard problem, as us nerdy engineers would say.\n\n# What I Had to Do\n\nI needed to define and build an authentic company culture that would:\n\n*   Improve team retention and morale\n*   Create shared values and working principles\n*   Scale with our growing team\n*   Actually impact performance, not just be abstract concepts\n\n# My Approach\n\nI treated this like a product experiment and implemented several initiatives over the course of a year:\n\n## 1\\. Teamwide Personality Interviews\n\n*   Added 15-20 minute sessions where all team members meet candidates\n*   Helped both sides understand each other better\n*   Reduced future friction when working together\n\n## 2\\. Quarterly External Speaker Sessions\n\n*   Invited industry experts to speak to the team\n*   Gave us fresh perspectives and career path insights\n*   Rare chance to see how different roles achieve success\n\n## 3\\. Internal Book Clubs\n\n*   Launched reading groups encouraging everyone to participate\n*   Led discussions and shared takeaways\n*   Created space for self-driven learning and collective growth\n\n## 4\\. Off-site Culture Workshops\n\n*   Organized sessions where teammates reflected on past experiences\n*   Discussed ideal work cultures in small groups\n*   Simple sessions that helped us understand each other and align\n\n## 5\\. \"Everyone is a Product Manager\"\n\n*   Encouraged teammates to create and own tasks\n*   Anyone could raise important problems\n*   Solving each other's blockers became top priority\n\n## 6\\. Focus on Problems, Not Blame\n\n*   Bugs and mistakes are inevitable in software\n*   Focus always on fixing issues and preventing recurrence\n*   Encouraged risk-taking and owned outcomes together\n\n## 7\\. Profit-sharing Program\n\n*   Portion of platform revenue went to company-wide bonuses\n*   Growth recognized as team effort\n*   Every role contributed to outcomes\n\n# The Results\n\nThe results were impressive and measurable:\n\n*   **90%+ annual employee retention** in a high-churn market\n*   **85/100 score** in company-wide leadership survey\n*   **5 core values defined** through collaborative process:\n    *   Freedom with responsibility\n    *   Energetic and joyful work\n    *   Creativity\n    *   Flexibility and openness to change\n    *   Willingness to share\n*   **Sustainable culture framework** that scaled as we grew to 18 people\n*   **Team grew from 8 to 18** in 2 years with less than 3-month onboarding ramp\n\n# Key Insights\n\nThis experience taught me several crucial lessons:\n\n*   Culture can't be imposed top-down; it must be cultivated collaboratively\n*   Small, consistent experiments can have significant cultural impact\n*   Regular reflection and adjustment is essential for cultural evolution\n*   The investment in culture directly correlated with business performance\n*   A team that is aligned and united delivers the best results for customers\n\nThe job of the torchbearer is not necessarily to illuminate the one correct path, but to ignite flames in the hearts of others. With more torches lit, we can explore more paths together.",
          "slug": "culture-building-botbonnie"
        }
      ],
      "product": [
        {
          "title": "Staying Focused When Everything Feels Important",
          "summary": "By balancing impact, urgency, dependencies, and strategic goals, I successfully led multiple product initiatives at Appier — including an LLM Copilot and onboarding-focused features — while keeping stakeholders aligned and outcomes prioritized.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2021,
            2024
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "Communication",
            "Resource Management",
            "Decision Making",
            "Problem Solving"
          ],
          "interviewCategories": [
            "Leadership",
            "Project Management",
            "Strategic Thinking",
            "Stakeholder Management",
            "Prioritization"
          ],
          "questionTypes": [
            "Describe a time when you had to manage multiple priorities.",
            "How do you ensure alignment among stakeholders?",
            "Can you give an example of how you prioritized tasks in a project?",
            "What strategies do you use to manage dependencies in product development?",
            "Tell me about a time you had to make a tough decision regarding project priorities."
          ],
          "metrics": [],
          "keywords": [
            "impact",
            "projects",
            "once",
            "prioritize",
            "dependencies",
            "also",
            "copilot",
            "moved",
            "managing",
            "multiple",
            "using",
            "urgency",
            "strategic",
            "alignment",
            "example"
          ],
          "starStructure": {
            "situation": "When I’m managing multiple projects at once, I prioritize using a mix of **impact, urgency, dependencies, and strategic alignment**.",
            "task": "To prioritize, I first aligned with leadership on the **non-negotiables** — for instance, a quarterly goal tied to increasing onboarding conversion had to be met",
            "actions": [],
            "results": []
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "When I’m managing multiple projects at once, I prioritize using a mix of **impact, urgency, dependencies, and strategic alignment**.\n\nFor example, at Appier, I was leading two product lines — one for marketing automation, the other for chatbot engagement — while also prototyping a new LLM-based Copilot.\n\nTo prioritize, I first aligned with leadership on the **non-negotiables** — for instance, a quarterly goal tied to increasing onboarding conversion had to be met. That made the Journey Map Builder a top priority.\n\nThen I looked at **dependencies** — one feature blocked engineering work for another team, so I moved it up to avoid bottlenecks. I also reviewed **effort vs. impact**: some projects sounded exciting, like the LLM Copilot, but could be built as MVPs in two weeks to test demand.\n\nFinally, I communicated openly with stakeholders to set expectations, and reallocated resources or paused lower-impact items.\n\nThis helped me stay focused on what truly moved the needle, rather than trying to do everything at once.",
          "slug": "2025-08-03-staying-focused-when-everything-feels-important"
        },
        {
          "title": "The Cost of One Bad Hire: A Painful Lesson in Team Building",
          "summary": "A rushed hiring decision during a critical client engagement with Audi taught me that even one misaligned hire can damage team morale and trust, shaping how I approach hiring and culture-building ever since.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2018
          ],
          "competencies": [
            "leadership",
            "product_management",
            "crisis_management",
            "culture_building",
            "emotional_intelligence",
            "strategic_thinking",
            "adaptability",
            "team_building",
            "communication"
          ],
          "interviewCategories": [
            "Decision Making",
            "Team Dynamics",
            "Conflict Resolution",
            "Cultural Fit",
            "Leadership Challenges"
          ],
          "questionTypes": [
            "Describe a time when you made a hiring mistake and what you learned from it.",
            "How do you assess cultural fit during the hiring process?",
            "Can you provide an example of how a team member's behavior affected team morale?",
            "What strategies do you use to ensure team alignment and trust?",
            "Tell me about a time you had to manage a difficult situation with a client."
          ],
          "metrics": [],
          "keywords": [
            "team",
            "work",
            "most",
            "audi",
            "pressure",
            "project",
            "high",
            "strong",
            "experience",
            "culture",
            "result",
            "hiring",
            "painful",
            "valuable",
            "failures"
          ],
          "starStructure": {
            "situation": "One of the most painful but valuable failures in my career happened during the early days of BotBonnie.",
            "task": "Eventually, I had to let him go and personally explain the situation to Audi — which was not easy",
            "actions": [],
            "results": []
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "One of the most painful but valuable failures in my career happened during the early days of BotBonnie.\n\nWe were growing fast, had just launched several successful campaigns, and were about to work with a major client — Audi. Under pressure, I urgently needed a project manager to help manage this high-stakes engagement.\n\nWe found a candidate with a strong academic background and banking project management experience. While I noticed a slight mismatch in mindset and culture fit, I ignored my instinct due to time pressure and hired him.\n\nUnfortunately, the result was disastrous. His work was often sloppy, he resisted feedback, and his confrontational attitude disrupted team morale. Over three months, his presence negatively affected the team to the point where we two originally strong members were started to work like him. Eventually, I had to let him go and personally explain the situation to Audi — which was not easy.\n\nThat experience taught me a critical lesson: **in a startup, one bad hire can cost you far more than just productivity — it can affect team culture, trust, and momentum.**\n\nSince then, I’ve treated hiring as one of the most important decisions a founder makes. I invested in a more structured hiring process, involving team fit interviews, values alignment, and trial tasks. As a result, we gradually built a high-performing team that truly shared our vision.",
          "slug": "2025-08-03-the-cost-of-one-bad-hire-a-painful-lesson-in-team-building"
        },
        {
          "title": "Unifying the Customer Journey: From Siloed Tools to Seamless Platform",
          "summary": "Without formal authority, I led a company-wide transformation to unify Appier’s product suite, launching a successful MVP that reversed churn, secured executive buy-in, and reshaped the long-term product architecture.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022,
            2023
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "crisis_management",
            "growth",
            "technical",
            "stakeholder management",
            "customer-centricity",
            "communication",
            "negotiation",
            "visionary thinking"
          ],
          "interviewCategories": [
            "Leadership",
            "Problem Solving",
            "Collaboration",
            "Adaptability",
            "Strategic Thinking"
          ],
          "questionTypes": [
            "Describe a time you led a project without formal authority.",
            "How did you handle resistance when proposing a new initiative?",
            "Can you give an example of how you identified and addressed a customer pain point?",
            "What steps did you take to align cross-functional teams on a vision?",
            "How did you measure the success of your initiative?"
          ],
          "metrics": [
            "$300K",
            "in 3 months",
            "3",
            "15",
            "300"
          ],
          "keywords": [
            "data",
            "product",
            "botbonnie",
            "sales",
            "cloud",
            "clients",
            "across",
            "vision",
            "over",
            "three",
            "company",
            "months",
            "after",
            "appier",
            "cross"
          ],
          "starStructure": {
            "situation": "After Appier acquired my startup BotBonnie, I began sitting in on cross-functional sales pitches and noticed a recurring issue: while we marketed an end-to-end marketing solution, our products were siloed. Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie. This created a huge gap between what we promised and what we delivered—leading to poor product experience and low renewal intent.",
            "task": "Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie",
            "actions": [],
            "results": [
              "$300K",
              "in 3 months",
              "3",
              "15",
              "300"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "After Appier acquired my startup BotBonnie, I began sitting in on cross-functional sales pitches and noticed a recurring issue: while we marketed an end-to-end marketing solution, our products were siloed. Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie. This created a huge gap between what we promised and what we delivered—leading to poor product experience and low renewal intent.\n\nAt the same time, I saw a clear industry trend: brands were looking to unify first-party data and deliver personalized experiences across all channels—EDM, SMS, Web, App, and messaging platforms like LINE and WhatsApp. Appier had all the ingredients, but no one was owning the unification vision.\n\nAt the time, I was leading only the BotBonnie product line, with no authority over the other three product teams. Still, I felt responsible for fixing the fragmented user experience. My challenge was to build alignment across product, sales, and executive stakeholders—without formal ownership—and propose a vision that could influence company-wide roadmap and resources.\n\nFirst, I conducted over a dozen customer interviews and internal sessions with sales and customer success leaders to validate the pain points. I synthesized the findings into a three-year platform integration proposal that divided our products into two strategic pillars: **Personalization Cloud** (front-end orchestration) and **Data Cloud** (backend pipelines).\n\nI anticipated pushback around timing and resources, so I proposed a low-risk MVP: a **“Journey Map Builder”** that we could ship in 3 months using only my team. It offered clients a unified UI to design omnichannel campaigns and showcased what integration could look like.\n\nBefore going to the CEO, I aligned with our Chief Strategy Officer—incorporating his feedback and securing early buy-in. When I finally pitched to the CEO, I led with direct client quotes, market data, and a clear plan to phase the vision over time.\n\nThe CEO approved the plan in 15 minutes—and used my slides the next day at our company AMA. I was given cross-product authority to lead the initiative. Three months later, we launched the MVP, recovered **$300K ARR** from churn-risk clients, and received overwhelming feedback from sales and design teams.\n\nSix months later, I was promoted to **Senior Director**, overseeing both BotBonnie and AIQUA. Even after I left, the company continued to build on the same platform architecture I initiated—formally structuring the org around **Personalization Cloud** and **Data Cloud**.",
          "slug": "2025-08-03-unifying-the-customer-journey-from-siloed-tools-to-seamless-platform"
        },
        {
          "title": "Balancing Principles and Diplomacy in Cross-Regional Alignment",
          "summary": "When a roadmap disagreement escalated to the CEO, I resolved the tension by empathizing with regional priorities, offering a collaborative compromise, and preserving both strategic focus and team trust.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022
          ],
          "competencies": [
            "leadership",
            "product_management",
            "international",
            "empathy",
            "negotiation",
            "strategic thinking",
            "communication"
          ],
          "interviewCategories": [
            "Conflict Resolution",
            "Leadership",
            "Collaboration",
            "Stakeholder Management"
          ],
          "questionTypes": [
            "Describe a time you resolved a conflict within your team.",
            "How do you balance competing priorities from different stakeholders?",
            "Can you give an example of how you handled a disagreement with a superior?",
            "What strategies do you use to maintain team trust during challenging situations?"
          ],
          "metrics": [],
          "keywords": [
            "korea",
            "product",
            "sales",
            "leader",
            "strategy",
            "markets",
            "however",
            "roadmap",
            "quarter",
            "wasn",
            "business",
            "leadership",
            "about",
            "disagreement",
            "manager"
          ],
          "starStructure": {
            "situation": "One time I had a disagreement with my manager was at Appier, when I was leading product strategy across multiple regional markets.",
            "task": "",
            "actions": [],
            "results": []
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "One time I had a disagreement with my manager was at Appier, when I was leading product strategy across multiple regional markets.\n\nOur Korea sales leader was pushing hard to prioritize a product request for the Korean market. However, based on our existing roadmap and engineering capacity, I had already communicated — both to him and our CEO — that this would need to wait until the following quarter. The prioritization wasn’t arbitrary; it was aligned with overall business goals and agreed upon with leadership.\n\nHowever, the sales leader felt I was deprioritizing Korea and escalated the issue to the CEO, who then asked me to apologize and try to resolve the situation.\n\nI was initially very frustrated — from my perspective, I had been transparent and collaborative the whole time. I also worried that this would set a precedent that complaints could override product strategy.\n\nBut after cooling down, I tried to understand the bigger picture. The CEO wasn’t necessarily questioning my decision-making, but wanted to maintain momentum in Korea, which was one of our most promising markets.\n\nSo I proactively scheduled a call with the Korea sales leader. I acknowledged the misalignment in expectations, explained the roadmap again, and offered a compromise: we’d begin the **requirement scoping process early**, and **join any client-facing meetings** to support their pitches.\n\nThis helped rebuild trust, and Korea went on to deliver strong sales that quarter — even before the product was fully delivered.\n\nIt reminded me that sometimes leadership isn’t about being right — it’s about **balancing principles with diplomacy**, and finding solutions that move the business forward.",
          "slug": "2025-08-04-balancing-principles-and-diplomacy-in-cross-regional-alignment"
        },
        {
          "title": "Betting on Instagram: A Strategic Pivot for Market Entry",
          "summary": "By challenging the original roadmap and leading a rapid pivot to Instagram Messaging automation, I enabled a differentiated go-to-market strategy in Japan that won enterprise deals and positioned us as an early mover.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2021
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "growth",
            "technical",
            "Data Analysis",
            "Market Research",
            "Stakeholder Management",
            "Negotiation",
            "Cross-Functional Collaboration"
          ],
          "interviewCategories": [
            "Leadership",
            "Strategic Thinking",
            "Problem Solving",
            "Adaptability",
            "Innovation"
          ],
          "questionTypes": [
            "Describe a time you had to pivot a project strategy.",
            "How do you approach data-driven decision making?",
            "Can you give an example of how you led a team through a significant change?",
            "What steps do you take to evaluate market opportunities?",
            "How do you handle competing priorities in product management?"
          ],
          "metrics": [
            "50"
          ],
          "keywords": [
            "instagram",
            "japan",
            "automation",
            "market",
            "product",
            "messaging",
            "whether",
            "integration",
            "pivot",
            "sales",
            "deals",
            "launch",
            "month",
            "within",
            "enterprise"
          ],
          "starStructure": {
            "situation": "When Facebook released the Instagram Messaging API, we were debating whether to pause our ongoing product roadmap to prioritize Instagram automation. Our CEO preferred focusing on cross-product integration to support expansion in Japan.",
            "task": "",
            "actions": [],
            "results": [
              "50"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "When Facebook released the Instagram Messaging API, we were debating whether to pause our ongoing product roadmap to prioritize Instagram automation. Our CEO preferred focusing on cross-product integration to support expansion in Japan.\n\nAs the product lead, I wanted to evaluate whether reprioritizing to Instagram would be a smarter strategic move—and if so, convince leadership to pivot the plan.\n\nI gathered data from multiple sources:\n\n*   Market reports showed Instagram had 50% market penetration in Japan—behind only LINE and YouTube\n    \n*   Internal sales call notes revealed we were losing deals in Japan to pricing competition, with little differentiation\n    \n*   No competitors were offering Instagram Messaging-based automation yet\n    \n*   Our engineers estimated we could launch an MVP in under one month\n    \n\nI synthesized these insights and proposed a shift in focus—launch Instagram automation first to create a differentiated market entry strategy, and use that traction to expand into broader platform integration later.\n\nThe CEO agreed to pivot. Within a month, we launched three marketing automation scenarios for Instagram and enabled the Japan sales team to go to market with something truly novel. The feedback was very positive—enterprise clients were excited to test new engagement strategies. Within a few months, we closed several key enterprise deals, establishing BotBonnie as an early mover in Japan.",
          "slug": "2025-08-04-betting-on-instagram-a-strategic-pivot-for-market-entry"
        },
        {
          "title": "Bridging Cultures to Deliver Under Pressure",
          "summary": "Faced with timeline conflict on a cross-functional MVP, I defused tension by aligning personal incentives, reshaping scope, and building trust—resulting in on-time delivery, $300K in recovered revenue, and stronger cross-team collaboration.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "crisis_management",
            "growth",
            "technical",
            "empathy",
            "negotiation",
            "communication",
            "strategic thinking",
            "relationship building"
          ],
          "interviewCategories": [
            "Conflict Resolution",
            "Team Collaboration",
            "Leadership",
            "Adaptability",
            "Stakeholder Management"
          ],
          "questionTypes": [
            "Describe a time you resolved a conflict within a team.",
            "How do you handle tight deadlines with cross-functional teams?",
            "Can you provide an example of how you aligned team members with different perspectives?",
            "What strategies do you use to build trust among team members?",
            "Tell me about a time you had to adapt your approach to meet project goals."
          ],
          "metrics": [
            "$300K",
            "3",
            "2",
            "300"
          ],
          "keywords": [
            "team",
            "product",
            "estimates",
            "during",
            "strong",
            "shared",
            "about",
            "cross",
            "engineers",
            "different",
            "lines",
            "botbonnie",
            "tight",
            "three",
            "deadline"
          ],
          "starStructure": {
            "situation": "When I led the MVP development of Journey Map at Appier, I formed a new cross-functional team with engineers from two different product lines—BotBonnie (my original team) and another internal product group. We had a tight three-month deadline. The engineering manager and I had broken down the MVP scope into tasks and asked each engineer to estimate their time.",
            "task": "",
            "actions": [],
            "results": [
              "$300K",
              "3",
              "2",
              "300"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "When I led the MVP development of Journey Map at Appier, I formed a new cross-functional team with engineers from two different product lines—BotBonnie (my original team) and another internal product group. We had a tight three-month deadline. The engineering manager and I had broken down the MVP scope into tasks and asked each engineer to estimate their time.\n\nWhile the BotBonnie engineers gave estimates in line with expectations, one engineer from the other team estimated timelines that were 3x longer for tasks of similar complexity. During the planning meeting, he openly criticized the timeline as unrealistic and voiced strong resistance. This was more than just a difference in estimates—it revealed deeper cultural misalignment between teams.\n\nI first acknowledged his concerns and paused the meeting, promising to reassess the scope and timelines. The next day, I invited him to lunch outside office to understand his perspective.\n\nThrough the conversation, I learned his performance was evaluated heavily based on delivery completeness, lack of bugs, and timely execution—which made him risk-averse under our tight deadline. He worried that speed would come at the cost of quality.\n\nI shared the broader purpose of this MVP: to validate a new cross-product vision, demonstrate our ability to move fast, and rebuild trust with our executive team and customers. I emphasized that this was not about perfection, but velocity and iteration.\n\nTo support him, I made three commitments:\n\n1.  I spoke with his manager to align on performance criteria and assured him that I would take responsibility for risks during pilot testing.\n    \n2.  We re-scoped the MVP to separate “must-haves” from “nice-to-haves,” balancing ambition with feasibility.\n    \n3.  I promised to amplify the team’s impact and visibility, so their effort would be recognized beyond just delivery.\n    \n\nIn return, he agreed to re-evaluate the estimates with this new context and became an enthusiastic contributor to the team.\n\nWe successfully launched the MVP on time. During the beta phase, we recovered over $300K in ARR from churn-risk clients. Many leaders in the company, initially skeptical of our timeline, became strong supporters. I was later promoted to lead both product lines and continued scaling the platform.\n\nThis experience taught me that resolving conflict isn’t about “winning”—it’s about understanding what drives the other person and co-creating a shared goal.\n\nIt also reinforced my belief that building a high-performing team across different cultures requires more than just processes—it requires shared goals, psychological safety, and strong personal alignment.",
          "slug": "2025-08-04-bridging-cultures-to-deliver-under-pressure"
        },
        {
          "title": "Designing for the “Aha” Moment in Onboarding",
          "summary": "By streamlining onboarding into a goal-driven, in-flow experience, I increased chatbot publication by 20% and helped users reach product value faster—boosting both activation and retention.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2020
          ],
          "competencies": [
            "product_management",
            "growth",
            "technical",
            "culture_building",
            "data_analysis",
            "user_experience_design",
            "strategic_planning",
            "collaboration"
          ],
          "interviewCategories": [
            "Problem Solving",
            "Leadership",
            "Innovation",
            "User Experience"
          ],
          "questionTypes": [
            "Describe a time when you improved a process.",
            "How do you approach user feedback in product design?",
            "Can you give an example of a successful A/B test you conducted?",
            "What strategies do you use to enhance user engagement?"
          ],
          "metrics": [
            "20% increase",
            "20"
          ],
          "keywords": [
            "users",
            "onboarding",
            "flow",
            "steps",
            "published",
            "drop",
            "test",
            "registration",
            "botbonnie",
            "trying",
            "grow",
            "north",
            "star",
            "metric",
            "number"
          ],
          "starStructure": {
            "situation": "At BotBonnie, we were trying to grow our North Star metric: the number of active chatbots published on the platform. We believed that if users quickly got into our visual no-code builder and started creating flows, they would hit their “aha” moment and stick around.",
            "task": "We needed to improve this flow to boost activation and retention",
            "actions": [],
            "results": [
              "20% increase",
              "20"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "At BotBonnie, we were trying to grow our North Star metric: the number of active chatbots published on the platform. We believed that if users quickly got into our visual no-code builder and started creating flows, they would hit their “aha” moment and stick around.\n\nHowever, data from our onboarding funnel showed a sharp drop-off—many users were not completing key steps like designing a flow or connecting to messaging channels like Facebook or LINE. Most never published a bot. We needed to improve this flow to boost activation and retention.\n\nWe revisited our onboarding design and ran an A/B test.\n\nIn the new version, instead of having users go through multiple steps across different pages, we guided them to create a simple bot right inside the registration flow. They could select a channel, test the conversation, and publish—all within one screen and under three clicks per step.\n\nAlthough it slightly increased time spent in onboarding, the steps felt more goal-oriented and provided quicker feedback.\n\nThe new onboarding flow led to a 20% increase in bot publication, with no drop in registration completion. It was a small but high-leverage improvement that helped more users reach meaningful product value faster.",
          "slug": "2025-08-04-designing-for-the-aha-moment-in-onboarding"
        },
        {
          "title": "From Engineer to Enterprise Leader: The Journey Behind BotBonnie",
          "summary": "Building BotBonnie from scratch to $2M ARR and seeing it acquired was a milestone, but the real success was growing into a strategic leader who shaped product vision, built lasting teams, and created long-term impact across markets.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2016,
            2021
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "growth",
            "international",
            "strategic planning",
            "cross-functional collaboration",
            "market analysis",
            "cultural adaptability",
            "mentorship"
          ],
          "interviewCategories": [
            "Leadership",
            "Teamwork",
            "Adaptability",
            "Strategic Thinking",
            "Problem Solving"
          ],
          "questionTypes": [
            "Can you describe a time when you had to lead a team through a significant change?",
            "How do you approach building a product that meets market needs?",
            "What strategies do you use to foster team growth and development?",
            "Describe a challenging situation you faced during your tenure and how you overcame it.",
            "How do you balance technical skills with leadership responsibilities?"
          ],
          "metrics": [
            "$2M",
            "2M ARR",
            "2"
          ],
          "keywords": [
            "being",
            "team",
            "building",
            "botbonnie",
            "product",
            "appier",
            "through",
            "acquisition",
            "leadership",
            "most",
            "started",
            "still",
            "helped",
            "company",
            "part"
          ],
          "starStructure": {
            "situation": "My greatest professional success so far is building BotBonnie from the ground up, scaling it to $2M ARR, and eventually joining Appier through acquisition. But more than the business result, it’s the personal transformation and leadership growth that I’m most proud of.",
            "task": "I had to identify the right product-market fit, navigate competition, pitch investors and clients, and lead a cross-functional team through both failures and breakthroughs",
            "actions": [],
            "results": [
              "$2M",
              "2M ARR",
              "2"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "My greatest professional success so far is building BotBonnie from the ground up, scaling it to $2M ARR, and eventually joining Appier through acquisition. But more than the business result, it’s the personal transformation and leadership growth that I’m most proud of.\n\nWhen we started BotBonnie, I was still very much an engineer at heart—I loved building things. But as we grew, I realized that being a founder meant shifting from being a maker to being a strategist, team builder, and communicator.\n\nI had to identify the right product-market fit, navigate competition, pitch investors and clients, and lead a cross-functional team through both failures and breakthroughs.\n\nAfter being acquired by Appier, I stayed on and helped integrate BotBonnie into a broader enterprise suite. That came with its own set of challenges: adapting to a different company culture, building credibility internally, and helping my team thrive in a new environment. Over time, I earned the trust to drive platform strategy across two product lines, and helped scale the solution into markets like Japan and Korea.\n\nLooking back, the most meaningful part isn’t the acquisition or the ARR. It’s seeing team members grow into new leadership roles, seeing our product evolve into part of a public company’s long-term roadmap, and knowing that the vision we started with is still creating value years later.",
          "slug": "2025-08-04-from-engineer-to-enterprise-leader-the-journey-behind-botbonnie"
        },
        {
          "title": "Losing Audi — and Winning Them Back",
          "summary": "After losing a key client to a lowball competitor, I led a professional handoff, reflected deeply with my team, and focused on long-term value—ultimately earning back Audi’s trust and renewing the partnership.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2021
          ],
          "competencies": [
            "product_management",
            "innovation",
            "relationship_management",
            "strategic_planning",
            "team_collaboration",
            "communication"
          ],
          "interviewCategories": [
            "Leadership",
            "Problem Solving",
            "Client Relationship Management",
            "Resilience"
          ],
          "questionTypes": [
            "Describe a time you lost a key client and how you handled it.",
            "How do you approach rebuilding trust with a client after a setback?",
            "Can you provide an example of how you managed a difficult negotiation?",
            "What steps do you take to ensure long-term client relationships?"
          ],
          "metrics": [
            "2021"
          ],
          "keywords": [
            "audi",
            "competitor",
            "multi",
            "year",
            "partnership",
            "three",
            "contact",
            "came",
            "client",
            "loss",
            "long",
            "term",
            "value",
            "deal",
            "back"
          ],
          "starStructure": {
            "situation": "In 2021, we were renewing our multi-year partnership with Audi, one of BotBonnie’s first and most iconic enterprise clients. We had worked with them for three years, and they were a big part of our early success story.",
            "task": "",
            "actions": [],
            "results": [
              "2021"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "In 2021, we were renewing our multi-year partnership with Audi, one of BotBonnie’s first and most iconic enterprise clients. We had worked with them for three years, and they were a big part of our early success story.\n\nBut that year, our main contact at Audi left the company, and a new Taiwan GM came in. The renewal discussions became rocky. A competitor came in aggressively with much lower pricing and an unrealistic delivery timeline. We evaluated it carefully and knew that matching their offer would be unsustainable for us. Still, we tried to engage the client, explain the tradeoffs, and express our strong interest in continuing the partnership.\n\nDespite our effort, Audi chose the competitor. It was a tough blow—not only did we lose a key client, but internally, it felt like a personal loss. I gathered the team, and instead of blaming the outcome, we held a postmortem to analyze what went wrong—things like overreliance on a single contact, lack of multi-threading in the relationship, and a need to reframe how we communicated long-term value in a competitive deal.\n\nWe focused our energy on supporting the handoff professionally and doubling down on product innovation to strengthen our positioning.\n\nUnexpectedly, about three months later, Audi reached back out. The competitor had missed deadlines and overpromised. We were invited back in and eventually signed a new deal, regaining their trust.\n\nBut more importantly, the failure taught me not to take customer loyalty for granted, and that even in loss, your professionalism and long-term value can leave a lasting impression.",
          "slug": "2025-08-04-losing-audi-and-winning-them-back"
        },
        {
          "title": "Managing Risk Through Empathy and Alignment",
          "summary": "By uncovering the root of team resistance and aligning expectations across functions, I kept our high-stakes MVP on track—delivering on time, recovering $300K in ARR, and strengthening team cohesion.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022,
            2024
          ],
          "competencies": [
            "leadership",
            "product_management",
            "growth",
            "culture_building",
            "empathy",
            "communication",
            "stakeholder management",
            "strategic thinking",
            "adaptability"
          ],
          "interviewCategories": [
            "Leadership",
            "Conflict Resolution",
            "Team Collaboration",
            "Risk Management",
            "Change Management"
          ],
          "questionTypes": [
            "Describe a time when you had to manage a conflict within a team.",
            "How do you handle resistance from team members?",
            "Can you give an example of how you aligned a cross-functional team towards a common goal?",
            "What strategies do you use to manage project risks?",
            "Tell me about a time you had to deliver a project under a tight deadline."
          ],
          "metrics": [
            "$300K",
            "within 3 months",
            "3",
            "300"
          ],
          "keywords": [
            "team",
            "risk",
            "timeline",
            "quality",
            "impact",
            "leading",
            "cross",
            "functional",
            "deliver",
            "journey",
            "within",
            "months",
            "included",
            "engineers",
            "different"
          ],
          "starStructure": {
            "situation": "I was leading a cross-functional team to deliver the MVP of Journey Map within 3 months. The team included engineers from two very different product lines, each with their own working culture.",
            "task": "",
            "actions": [],
            "results": [
              "$300K",
              "within 3 months",
              "3",
              "300"
            ]
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "I was leading a cross-functional team to deliver the MVP of Journey Map within 3 months. The team included engineers from two very different product lines, each with their own working culture.\n\nEarly in planning, we encountered a major risk. One engineer estimated timelines that were 3x longer than others for similar tasks. He believed the timeline was unrealistic and feared it would compromise code quality—due to how his performance was measured, he was hesitant to cut corners or move fast.\n\nI identified several risks: timeline delays, quality issues, team morale, and internal credibility.\n\nTo address them, I:\n\n*   Took the time to understand the root cause behind his resistance by having a one-on-one lunch\n    \n*   Re-scoped the MVP to distinguish “must-have” and “nice-to-have” features\n    \n*   Spoke directly with his manager to align on evaluation expectations and assured I would take ownership of pilot-phase bugs\n    \n*   Reframed the goal of this MVP to focus on iteration speed and customer impact, not perfection\n    \n*   Positioned the project as high-impact to increase recognition and motivation across the team\n    \n\nWe launched the MVP on time, recovered $300K in ARR from churn-risk customers, and earned strong support from execs who were initially skeptical.\n\nThe experience taught me that effective risk management requires not just tactical mitigation, but also empathy, communication, and cultural alignment.",
          "slug": "2025-08-04-managing-risk-through-empathy-and-alignment"
        },
        {
          "title": "Turning a Crisis into a Catalyst for Product Growth",
          "summary": "When a major campaign nearly became a PR disaster, I led a rapid response that uncovered systemic issues, turned a furious client into a success story, and sparked lasting improvements in product design, support, and retention.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2017
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "growth",
            "technical",
            "empathy",
            "communication",
            "analytical thinking",
            "strategic planning",
            "collaboration"
          ],
          "interviewCategories": [
            "Crisis Management",
            "Customer Service",
            "Product Development",
            "Leadership",
            "Problem Solving"
          ],
          "questionTypes": [
            "Describe a time you turned a negative customer experience into a positive outcome.",
            "How do you handle high-pressure situations with clients?",
            "Can you give an example of how you identified and solved a systemic issue?",
            "What steps do you take to ensure customer satisfaction during a crisis?",
            "How do you prioritize tasks when addressing urgent client concerns?"
          ],
          "metrics": [
            "2017",
            "2",
            "3",
            "4"
          ],
          "keywords": [
            "client",
            "high",
            "product",
            "most",
            "chatbot",
            "design",
            "after",
            "user",
            "profile",
            "clients",
            "platform",
            "launch",
            "campaign",
            "success",
            "stories"
          ],
          "starStructure": {
            "situation": "In 2017, one of our most high-profile brand clients used our chatbot platform to launch a major Messenger campaign. They invested significant time and budget into the design and had high expectations, especially after seeing our previous success stories.",
            "task": "As co-founder, I had to address their frustration, uncover the root cause, and prevent churn or reputational damage",
            "actions": [],
            "results": [
              "2017",
              "2",
              "3",
              "4"
            ]
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "In 2017, one of our most high-profile brand clients used our chatbot platform to launch a major Messenger campaign. They invested significant time and budget into the design and had high expectations, especially after seeing our previous success stories.\n\nThree days after launch, the client was furious. The campaign had far fewer user completions than expected. Most users dropped off after the first few messages, and the client claimed the product was misleading and poorly designed. They threatened to publicly discredit us and demanded compensation. As co-founder, I had to address their frustration, uncover the root cause, and prevent churn or reputational damage.\n\nFirst, I responded personally to acknowledge their disappointment, assured them we were taking this seriously, and immediately assigned our CS team to engage directly with the client. I also formed a small task-force team—myself, a PM, and an engineer—to investigate user behavior data.\n\nWithin a few hours, we found that poor conversation design caused user confusion and high drop-off. The core issues were:\n\n*   The client lacked guidance and didn’t know the best practice on how to structure a decision-tree chatbot.\n    \n*   Our product dashboard only reported final results, making it hard to detect UX bottlenecks.\n    \n*   Our internal systems didn’t flag high-profile clients using the self-service platform, so CS hadn’t proactively supported them.\n    \n\nThe next day, I made several decisions:\n\n1.  We created and promoted educational content on conversation design best practices across our customer channels.\n    \n2.  We ideated a heatmap-style visualization tool to help identify drop-off points in chatbot flows.\n    \n3.  We enhanced our internal dashboard to automatically flag high-value self-service accounts, enabling proactive CS outreach.\n    \n4.  I called the client directly to explain the findings, offered CS assistance to rebuild their flow, and shared our roadmap to address the gaps.\n    \n\nWhat started as a potential PR disaster turned into a long-term partnership. The client appreciated our transparency and follow-through, stayed with us, and later became one of our public success stories. Internally, the heatmap and account detection tools became key features that improved product quality and customer retention.\n\nThis experience taught me that difficult customers are often your most valuable. Their frustration is rarely random—it’s a signal that something deeper is broken. By responding with empathy, moving quickly, and thinking systemically, we not only saved the account but improved the product for everyone.",
          "slug": "2025-08-04-turning-a-crisis-into-a-catalyst-for-product-growth"
        },
        {
          "title": "Turning Data Drop-Off into Delight: The Power of Playful Incentives",
          "summary": "To solve low campaign completion rates at BotBonnie, I introduced personalized visual rewards that transformed user flows into engaging experiences—boosting completion to 85%, driving viral sharing, and creating a profitable new product module.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2019
          ],
          "competencies": [
            "product_management",
            "innovation",
            "growth",
            "user_experience_design",
            "data_analysis",
            "marketing_strategy",
            "team_collaboration"
          ],
          "interviewCategories": [
            "Problem Solving",
            "Innovation",
            "Leadership",
            "Collaboration",
            "Results Orientation"
          ],
          "questionTypes": [
            "Can you describe a time when you overcame a significant challenge?",
            "How do you approach innovation in your work?",
            "Tell me about a successful project you led.",
            "How do you motivate your team to achieve goals?",
            "What strategies do you use to improve user engagement?"
          ],
          "metrics": [
            "85",
            "30",
            "9",
            "4"
          ],
          "keywords": [
            "users",
            "burger",
            "campaign",
            "share",
            "example",
            "chatbot",
            "worked",
            "brands",
            "create",
            "user",
            "through",
            "based",
            "flows",
            "engineers",
            "image"
          ],
          "starStructure": {
            "situation": "One example that comes to mind was during my time at BotBonnie, a chatbot marketing platform I co-founded. We worked with brands to create interactive campaigns that collected user preferences through button-based flows.",
            "task": "",
            "actions": [],
            "results": [
              "85",
              "30"
            ]
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "One example that comes to mind was during my time at BotBonnie, a chatbot marketing platform I co-founded. We worked with brands to create interactive campaigns that collected user preferences through button-based flows.\n\nI noticed a consistent issue: many users dropped off before completing these flows, which meant incomplete data for brands and poor campaign performance.\n\nI realized the core problem was a lack of value exchange — we were asking users to give information without offering anything fun or engaging in return. So I proposed a creative solution: what if we could generate **personalized visual rewards** based on user input? Something they’d actually want to share or use.\n\nI worked with our engineers to develop a lightweight image generation module that could dynamically create visuals using users’ choices and attributes, such as their name or selected items. One standout example was a campaign we ran with Shopee and Burger King in Taiwan.\n\nUsers built their own burger by selecting ingredients through a chatbot. At the end, we generated a **custom burger image** for them — which they could either share on social media or **redeem at Burger King for a real custom burger**.\n\nThe results were huge: **hundreds of thousands of users participated**, with an **85% completion rate** and **30% social sharing**. More importantly, what started as a one-off idea evolved into one of our **most profitable and reusable product modules** — engineers could set it up in 30 minutes, and it brought in thousands of dollars in recurring revenue per campaign.\n\nThis experience taught me that innovation doesn’t always require cutting-edge technology — sometimes it’s about rethinking incentives and creating delightful moments that users _want_ to complete and share.\n\n### Campaign Video: [https://www.youtube.com/watch?v=E9c4\\_IgArF0](https://www.youtube.com/watch?v=E9c4_IgArF0)",
          "slug": "2025-08-04-turning-data-drop-off-into-delight-the-power-of-playful-incentives"
        },
        {
          "title": "Building Company Culture from Ground Up",
          "summary": "How I transformed BotBonnie's culture from a vague concept to defined values that achieved 90% retention",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2019,
            2021
          ],
          "competencies": [
            "leadership",
            "product_management",
            "crisis_management",
            "growth",
            "culture_building",
            "strategic_planning",
            "employee_engagement",
            "communication",
            "collaboration",
            "innovation"
          ],
          "interviewCategories": [
            "Leadership and Management",
            "Team Dynamics",
            "Cultural Fit",
            "Problem Solving",
            "Change Management"
          ],
          "questionTypes": [
            "Describe a time you faced a cultural challenge in your team.",
            "How do you approach building a positive company culture?",
            "Can you provide an example of how you improved team morale?",
            "What strategies have you used to retain employees?",
            "How do you handle feedback from team members regarding culture?"
          ],
          "metrics": [
            "8 team members",
            "18 people",
            "2",
            "8",
            "15",
            "20",
            "3",
            "4",
            "5",
            "6"
          ],
          "keywords": [
            "culture",
            "team",
            "company",
            "sessions",
            "grew",
            "morale",
            "work",
            "together",
            "results",
            "botbonnie",
            "members",
            "problem",
            "teammate",
            "directly",
            "needed"
          ],
          "starStructure": {
            "situation": "When BotBonnie grew from 2 founders to 8 team members, I realized we had a culture problem. During a one-on-one, a usually quiet teammate asked me directly: \"What is BotBonnie's company culture?\" I didn't have a good answer, and I could see that morale was declining. That teammate eventually left, which was a wake-up call that I needed to be intentional about culture.\n\nAt that time, the overall morale hit a low point. I even started questioning the meaning of my own work. Company culture became an unsolvable puzzle in my mind, something like an NP-hard problem, as us nerdy engineers would say.",
            "task": "I needed to define and build an authentic company culture that would:\n\n*   Improve team retention and morale\n*   Create shared values and working principles\n*   Scale with our growing team\n*   Actually impact performance, not just be abstract concepts",
            "actions": [],
            "results": [
              "%+ annual employee retention** in a high-churn market",
              "/100 score** in company-wide leadership survey",
              "core values defined** through collaborative process:",
              "Freedom with responsibility",
              "Energetic and joyful work",
              "Creativity",
              "Flexibility and openness to change",
              "Willingness to share"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "# The Challenge\n\nWhen BotBonnie grew from 2 founders to 8 team members, I realized we had a culture problem. During a one-on-one, a usually quiet teammate asked me directly: \"What is BotBonnie's company culture?\" I didn't have a good answer, and I could see that morale was declining. That teammate eventually left, which was a wake-up call that I needed to be intentional about culture.\n\nAt that time, the overall morale hit a low point. I even started questioning the meaning of my own work. Company culture became an unsolvable puzzle in my mind, something like an NP-hard problem, as us nerdy engineers would say.\n\n# What I Had to Do\n\nI needed to define and build an authentic company culture that would:\n\n*   Improve team retention and morale\n*   Create shared values and working principles\n*   Scale with our growing team\n*   Actually impact performance, not just be abstract concepts\n\n# My Approach\n\nI treated this like a product experiment and implemented several initiatives over the course of a year:\n\n## 1\\. Teamwide Personality Interviews\n\n*   Added 15-20 minute sessions where all team members meet candidates\n*   Helped both sides understand each other better\n*   Reduced future friction when working together\n\n## 2\\. Quarterly External Speaker Sessions\n\n*   Invited industry experts to speak to the team\n*   Gave us fresh perspectives and career path insights\n*   Rare chance to see how different roles achieve success\n\n## 3\\. Internal Book Clubs\n\n*   Launched reading groups encouraging everyone to participate\n*   Led discussions and shared takeaways\n*   Created space for self-driven learning and collective growth\n\n## 4\\. Off-site Culture Workshops\n\n*   Organized sessions where teammates reflected on past experiences\n*   Discussed ideal work cultures in small groups\n*   Simple sessions that helped us understand each other and align\n\n## 5\\. \"Everyone is a Product Manager\"\n\n*   Encouraged teammates to create and own tasks\n*   Anyone could raise important problems\n*   Solving each other's blockers became top priority\n\n## 6\\. Focus on Problems, Not Blame\n\n*   Bugs and mistakes are inevitable in software\n*   Focus always on fixing issues and preventing recurrence\n*   Encouraged risk-taking and owned outcomes together\n\n## 7\\. Profit-sharing Program\n\n*   Portion of platform revenue went to company-wide bonuses\n*   Growth recognized as team effort\n*   Every role contributed to outcomes\n\n# The Results\n\nThe results were impressive and measurable:\n\n*   **90%+ annual employee retention** in a high-churn market\n*   **85/100 score** in company-wide leadership survey\n*   **5 core values defined** through collaborative process:\n    *   Freedom with responsibility\n    *   Energetic and joyful work\n    *   Creativity\n    *   Flexibility and openness to change\n    *   Willingness to share\n*   **Sustainable culture framework** that scaled as we grew to 18 people\n*   **Team grew from 8 to 18** in 2 years with less than 3-month onboarding ramp\n\n# Key Insights\n\nThis experience taught me several crucial lessons:\n\n*   Culture can't be imposed top-down; it must be cultivated collaboratively\n*   Small, consistent experiments can have significant cultural impact\n*   Regular reflection and adjustment is essential for cultural evolution\n*   The investment in culture directly correlated with business performance\n*   A team that is aligned and united delivers the best results for customers\n\nThe job of the torchbearer is not necessarily to illuminate the one correct path, but to ignite flames in the hearts of others. With more torches lit, we can explore more paths together.",
          "slug": "culture-building-botbonnie"
        }
      ],
      "technical": [
        {
          "title": "Unifying the Customer Journey: From Siloed Tools to Seamless Platform",
          "summary": "Without formal authority, I led a company-wide transformation to unify Appier’s product suite, launching a successful MVP that reversed churn, secured executive buy-in, and reshaped the long-term product architecture.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022,
            2023
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "crisis_management",
            "growth",
            "technical",
            "stakeholder management",
            "customer-centricity",
            "communication",
            "negotiation",
            "visionary thinking"
          ],
          "interviewCategories": [
            "Leadership",
            "Problem Solving",
            "Collaboration",
            "Adaptability",
            "Strategic Thinking"
          ],
          "questionTypes": [
            "Describe a time you led a project without formal authority.",
            "How did you handle resistance when proposing a new initiative?",
            "Can you give an example of how you identified and addressed a customer pain point?",
            "What steps did you take to align cross-functional teams on a vision?",
            "How did you measure the success of your initiative?"
          ],
          "metrics": [
            "$300K",
            "in 3 months",
            "3",
            "15",
            "300"
          ],
          "keywords": [
            "data",
            "product",
            "botbonnie",
            "sales",
            "cloud",
            "clients",
            "across",
            "vision",
            "over",
            "three",
            "company",
            "months",
            "after",
            "appier",
            "cross"
          ],
          "starStructure": {
            "situation": "After Appier acquired my startup BotBonnie, I began sitting in on cross-functional sales pitches and noticed a recurring issue: while we marketed an end-to-end marketing solution, our products were siloed. Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie. This created a huge gap between what we promised and what we delivered—leading to poor product experience and low renewal intent.",
            "task": "Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie",
            "actions": [],
            "results": [
              "$300K",
              "in 3 months",
              "3",
              "15",
              "300"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "After Appier acquired my startup BotBonnie, I began sitting in on cross-functional sales pitches and noticed a recurring issue: while we marketed an end-to-end marketing solution, our products were siloed. Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie. This created a huge gap between what we promised and what we delivered—leading to poor product experience and low renewal intent.\n\nAt the same time, I saw a clear industry trend: brands were looking to unify first-party data and deliver personalized experiences across all channels—EDM, SMS, Web, App, and messaging platforms like LINE and WhatsApp. Appier had all the ingredients, but no one was owning the unification vision.\n\nAt the time, I was leading only the BotBonnie product line, with no authority over the other three product teams. Still, I felt responsible for fixing the fragmented user experience. My challenge was to build alignment across product, sales, and executive stakeholders—without formal ownership—and propose a vision that could influence company-wide roadmap and resources.\n\nFirst, I conducted over a dozen customer interviews and internal sessions with sales and customer success leaders to validate the pain points. I synthesized the findings into a three-year platform integration proposal that divided our products into two strategic pillars: **Personalization Cloud** (front-end orchestration) and **Data Cloud** (backend pipelines).\n\nI anticipated pushback around timing and resources, so I proposed a low-risk MVP: a **“Journey Map Builder”** that we could ship in 3 months using only my team. It offered clients a unified UI to design omnichannel campaigns and showcased what integration could look like.\n\nBefore going to the CEO, I aligned with our Chief Strategy Officer—incorporating his feedback and securing early buy-in. When I finally pitched to the CEO, I led with direct client quotes, market data, and a clear plan to phase the vision over time.\n\nThe CEO approved the plan in 15 minutes—and used my slides the next day at our company AMA. I was given cross-product authority to lead the initiative. Three months later, we launched the MVP, recovered **$300K ARR** from churn-risk clients, and received overwhelming feedback from sales and design teams.\n\nSix months later, I was promoted to **Senior Director**, overseeing both BotBonnie and AIQUA. Even after I left, the company continued to build on the same platform architecture I initiated—formally structuring the org around **Personalization Cloud** and **Data Cloud**.",
          "slug": "2025-08-03-unifying-the-customer-journey-from-siloed-tools-to-seamless-platform"
        },
        {
          "title": "Betting on Instagram: A Strategic Pivot for Market Entry",
          "summary": "By challenging the original roadmap and leading a rapid pivot to Instagram Messaging automation, I enabled a differentiated go-to-market strategy in Japan that won enterprise deals and positioned us as an early mover.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2021
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "growth",
            "technical",
            "Data Analysis",
            "Market Research",
            "Stakeholder Management",
            "Negotiation",
            "Cross-Functional Collaboration"
          ],
          "interviewCategories": [
            "Leadership",
            "Strategic Thinking",
            "Problem Solving",
            "Adaptability",
            "Innovation"
          ],
          "questionTypes": [
            "Describe a time you had to pivot a project strategy.",
            "How do you approach data-driven decision making?",
            "Can you give an example of how you led a team through a significant change?",
            "What steps do you take to evaluate market opportunities?",
            "How do you handle competing priorities in product management?"
          ],
          "metrics": [
            "50"
          ],
          "keywords": [
            "instagram",
            "japan",
            "automation",
            "market",
            "product",
            "messaging",
            "whether",
            "integration",
            "pivot",
            "sales",
            "deals",
            "launch",
            "month",
            "within",
            "enterprise"
          ],
          "starStructure": {
            "situation": "When Facebook released the Instagram Messaging API, we were debating whether to pause our ongoing product roadmap to prioritize Instagram automation. Our CEO preferred focusing on cross-product integration to support expansion in Japan.",
            "task": "",
            "actions": [],
            "results": [
              "50"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "When Facebook released the Instagram Messaging API, we were debating whether to pause our ongoing product roadmap to prioritize Instagram automation. Our CEO preferred focusing on cross-product integration to support expansion in Japan.\n\nAs the product lead, I wanted to evaluate whether reprioritizing to Instagram would be a smarter strategic move—and if so, convince leadership to pivot the plan.\n\nI gathered data from multiple sources:\n\n*   Market reports showed Instagram had 50% market penetration in Japan—behind only LINE and YouTube\n    \n*   Internal sales call notes revealed we were losing deals in Japan to pricing competition, with little differentiation\n    \n*   No competitors were offering Instagram Messaging-based automation yet\n    \n*   Our engineers estimated we could launch an MVP in under one month\n    \n\nI synthesized these insights and proposed a shift in focus—launch Instagram automation first to create a differentiated market entry strategy, and use that traction to expand into broader platform integration later.\n\nThe CEO agreed to pivot. Within a month, we launched three marketing automation scenarios for Instagram and enabled the Japan sales team to go to market with something truly novel. The feedback was very positive—enterprise clients were excited to test new engagement strategies. Within a few months, we closed several key enterprise deals, establishing BotBonnie as an early mover in Japan.",
          "slug": "2025-08-04-betting-on-instagram-a-strategic-pivot-for-market-entry"
        },
        {
          "title": "Bridging Cultures to Deliver Under Pressure",
          "summary": "Faced with timeline conflict on a cross-functional MVP, I defused tension by aligning personal incentives, reshaping scope, and building trust—resulting in on-time delivery, $300K in recovered revenue, and stronger cross-team collaboration.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "crisis_management",
            "growth",
            "technical",
            "empathy",
            "negotiation",
            "communication",
            "strategic thinking",
            "relationship building"
          ],
          "interviewCategories": [
            "Conflict Resolution",
            "Team Collaboration",
            "Leadership",
            "Adaptability",
            "Stakeholder Management"
          ],
          "questionTypes": [
            "Describe a time you resolved a conflict within a team.",
            "How do you handle tight deadlines with cross-functional teams?",
            "Can you provide an example of how you aligned team members with different perspectives?",
            "What strategies do you use to build trust among team members?",
            "Tell me about a time you had to adapt your approach to meet project goals."
          ],
          "metrics": [
            "$300K",
            "3",
            "2",
            "300"
          ],
          "keywords": [
            "team",
            "product",
            "estimates",
            "during",
            "strong",
            "shared",
            "about",
            "cross",
            "engineers",
            "different",
            "lines",
            "botbonnie",
            "tight",
            "three",
            "deadline"
          ],
          "starStructure": {
            "situation": "When I led the MVP development of Journey Map at Appier, I formed a new cross-functional team with engineers from two different product lines—BotBonnie (my original team) and another internal product group. We had a tight three-month deadline. The engineering manager and I had broken down the MVP scope into tasks and asked each engineer to estimate their time.",
            "task": "",
            "actions": [],
            "results": [
              "$300K",
              "3",
              "2",
              "300"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "When I led the MVP development of Journey Map at Appier, I formed a new cross-functional team with engineers from two different product lines—BotBonnie (my original team) and another internal product group. We had a tight three-month deadline. The engineering manager and I had broken down the MVP scope into tasks and asked each engineer to estimate their time.\n\nWhile the BotBonnie engineers gave estimates in line with expectations, one engineer from the other team estimated timelines that were 3x longer for tasks of similar complexity. During the planning meeting, he openly criticized the timeline as unrealistic and voiced strong resistance. This was more than just a difference in estimates—it revealed deeper cultural misalignment between teams.\n\nI first acknowledged his concerns and paused the meeting, promising to reassess the scope and timelines. The next day, I invited him to lunch outside office to understand his perspective.\n\nThrough the conversation, I learned his performance was evaluated heavily based on delivery completeness, lack of bugs, and timely execution—which made him risk-averse under our tight deadline. He worried that speed would come at the cost of quality.\n\nI shared the broader purpose of this MVP: to validate a new cross-product vision, demonstrate our ability to move fast, and rebuild trust with our executive team and customers. I emphasized that this was not about perfection, but velocity and iteration.\n\nTo support him, I made three commitments:\n\n1.  I spoke with his manager to align on performance criteria and assured him that I would take responsibility for risks during pilot testing.\n    \n2.  We re-scoped the MVP to separate “must-haves” from “nice-to-haves,” balancing ambition with feasibility.\n    \n3.  I promised to amplify the team’s impact and visibility, so their effort would be recognized beyond just delivery.\n    \n\nIn return, he agreed to re-evaluate the estimates with this new context and became an enthusiastic contributor to the team.\n\nWe successfully launched the MVP on time. During the beta phase, we recovered over $300K in ARR from churn-risk clients. Many leaders in the company, initially skeptical of our timeline, became strong supporters. I was later promoted to lead both product lines and continued scaling the platform.\n\nThis experience taught me that resolving conflict isn’t about “winning”—it’s about understanding what drives the other person and co-creating a shared goal.\n\nIt also reinforced my belief that building a high-performing team across different cultures requires more than just processes—it requires shared goals, psychological safety, and strong personal alignment.",
          "slug": "2025-08-04-bridging-cultures-to-deliver-under-pressure"
        },
        {
          "title": "Designing for the “Aha” Moment in Onboarding",
          "summary": "By streamlining onboarding into a goal-driven, in-flow experience, I increased chatbot publication by 20% and helped users reach product value faster—boosting both activation and retention.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2020
          ],
          "competencies": [
            "product_management",
            "growth",
            "technical",
            "culture_building",
            "data_analysis",
            "user_experience_design",
            "strategic_planning",
            "collaboration"
          ],
          "interviewCategories": [
            "Problem Solving",
            "Leadership",
            "Innovation",
            "User Experience"
          ],
          "questionTypes": [
            "Describe a time when you improved a process.",
            "How do you approach user feedback in product design?",
            "Can you give an example of a successful A/B test you conducted?",
            "What strategies do you use to enhance user engagement?"
          ],
          "metrics": [
            "20% increase",
            "20"
          ],
          "keywords": [
            "users",
            "onboarding",
            "flow",
            "steps",
            "published",
            "drop",
            "test",
            "registration",
            "botbonnie",
            "trying",
            "grow",
            "north",
            "star",
            "metric",
            "number"
          ],
          "starStructure": {
            "situation": "At BotBonnie, we were trying to grow our North Star metric: the number of active chatbots published on the platform. We believed that if users quickly got into our visual no-code builder and started creating flows, they would hit their “aha” moment and stick around.",
            "task": "We needed to improve this flow to boost activation and retention",
            "actions": [],
            "results": [
              "20% increase",
              "20"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "At BotBonnie, we were trying to grow our North Star metric: the number of active chatbots published on the platform. We believed that if users quickly got into our visual no-code builder and started creating flows, they would hit their “aha” moment and stick around.\n\nHowever, data from our onboarding funnel showed a sharp drop-off—many users were not completing key steps like designing a flow or connecting to messaging channels like Facebook or LINE. Most never published a bot. We needed to improve this flow to boost activation and retention.\n\nWe revisited our onboarding design and ran an A/B test.\n\nIn the new version, instead of having users go through multiple steps across different pages, we guided them to create a simple bot right inside the registration flow. They could select a channel, test the conversation, and publish—all within one screen and under three clicks per step.\n\nAlthough it slightly increased time spent in onboarding, the steps felt more goal-oriented and provided quicker feedback.\n\nThe new onboarding flow led to a 20% increase in bot publication, with no drop in registration completion. It was a small but high-leverage improvement that helped more users reach meaningful product value faster.",
          "slug": "2025-08-04-designing-for-the-aha-moment-in-onboarding"
        },
        {
          "title": "Turning a Crisis into a Catalyst for Product Growth",
          "summary": "When a major campaign nearly became a PR disaster, I led a rapid response that uncovered systemic issues, turned a furious client into a success story, and sparked lasting improvements in product design, support, and retention.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2017
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "growth",
            "technical",
            "empathy",
            "communication",
            "analytical thinking",
            "strategic planning",
            "collaboration"
          ],
          "interviewCategories": [
            "Crisis Management",
            "Customer Service",
            "Product Development",
            "Leadership",
            "Problem Solving"
          ],
          "questionTypes": [
            "Describe a time you turned a negative customer experience into a positive outcome.",
            "How do you handle high-pressure situations with clients?",
            "Can you give an example of how you identified and solved a systemic issue?",
            "What steps do you take to ensure customer satisfaction during a crisis?",
            "How do you prioritize tasks when addressing urgent client concerns?"
          ],
          "metrics": [
            "2017",
            "2",
            "3",
            "4"
          ],
          "keywords": [
            "client",
            "high",
            "product",
            "most",
            "chatbot",
            "design",
            "after",
            "user",
            "profile",
            "clients",
            "platform",
            "launch",
            "campaign",
            "success",
            "stories"
          ],
          "starStructure": {
            "situation": "In 2017, one of our most high-profile brand clients used our chatbot platform to launch a major Messenger campaign. They invested significant time and budget into the design and had high expectations, especially after seeing our previous success stories.",
            "task": "As co-founder, I had to address their frustration, uncover the root cause, and prevent churn or reputational damage",
            "actions": [],
            "results": [
              "2017",
              "2",
              "3",
              "4"
            ]
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "In 2017, one of our most high-profile brand clients used our chatbot platform to launch a major Messenger campaign. They invested significant time and budget into the design and had high expectations, especially after seeing our previous success stories.\n\nThree days after launch, the client was furious. The campaign had far fewer user completions than expected. Most users dropped off after the first few messages, and the client claimed the product was misleading and poorly designed. They threatened to publicly discredit us and demanded compensation. As co-founder, I had to address their frustration, uncover the root cause, and prevent churn or reputational damage.\n\nFirst, I responded personally to acknowledge their disappointment, assured them we were taking this seriously, and immediately assigned our CS team to engage directly with the client. I also formed a small task-force team—myself, a PM, and an engineer—to investigate user behavior data.\n\nWithin a few hours, we found that poor conversation design caused user confusion and high drop-off. The core issues were:\n\n*   The client lacked guidance and didn’t know the best practice on how to structure a decision-tree chatbot.\n    \n*   Our product dashboard only reported final results, making it hard to detect UX bottlenecks.\n    \n*   Our internal systems didn’t flag high-profile clients using the self-service platform, so CS hadn’t proactively supported them.\n    \n\nThe next day, I made several decisions:\n\n1.  We created and promoted educational content on conversation design best practices across our customer channels.\n    \n2.  We ideated a heatmap-style visualization tool to help identify drop-off points in chatbot flows.\n    \n3.  We enhanced our internal dashboard to automatically flag high-value self-service accounts, enabling proactive CS outreach.\n    \n4.  I called the client directly to explain the findings, offered CS assistance to rebuild their flow, and shared our roadmap to address the gaps.\n    \n\nWhat started as a potential PR disaster turned into a long-term partnership. The client appreciated our transparency and follow-through, stayed with us, and later became one of our public success stories. Internally, the heatmap and account detection tools became key features that improved product quality and customer retention.\n\nThis experience taught me that difficult customers are often your most valuable. Their frustration is rarely random—it’s a signal that something deeper is broken. By responding with empathy, moving quickly, and thinking systemically, we not only saved the account but improved the product for everyone.",
          "slug": "2025-08-04-turning-a-crisis-into-a-catalyst-for-product-growth"
        }
      ],
      "business": [
        {
          "title": "Unifying the Customer Journey: From Siloed Tools to Seamless Platform",
          "summary": "Without formal authority, I led a company-wide transformation to unify Appier’s product suite, launching a successful MVP that reversed churn, secured executive buy-in, and reshaped the long-term product architecture.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022,
            2023
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "crisis_management",
            "growth",
            "technical",
            "stakeholder management",
            "customer-centricity",
            "communication",
            "negotiation",
            "visionary thinking"
          ],
          "interviewCategories": [
            "Leadership",
            "Problem Solving",
            "Collaboration",
            "Adaptability",
            "Strategic Thinking"
          ],
          "questionTypes": [
            "Describe a time you led a project without formal authority.",
            "How did you handle resistance when proposing a new initiative?",
            "Can you give an example of how you identified and addressed a customer pain point?",
            "What steps did you take to align cross-functional teams on a vision?",
            "How did you measure the success of your initiative?"
          ],
          "metrics": [
            "$300K",
            "in 3 months",
            "3",
            "15",
            "300"
          ],
          "keywords": [
            "data",
            "product",
            "botbonnie",
            "sales",
            "cloud",
            "clients",
            "across",
            "vision",
            "over",
            "three",
            "company",
            "months",
            "after",
            "appier",
            "cross"
          ],
          "starStructure": {
            "situation": "After Appier acquired my startup BotBonnie, I began sitting in on cross-functional sales pitches and noticed a recurring issue: while we marketed an end-to-end marketing solution, our products were siloed. Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie. This created a huge gap between what we promised and what we delivered—leading to poor product experience and low renewal intent.",
            "task": "Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie",
            "actions": [],
            "results": [
              "$300K",
              "in 3 months",
              "3",
              "15",
              "300"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "After Appier acquired my startup BotBonnie, I began sitting in on cross-functional sales pitches and noticed a recurring issue: while we marketed an end-to-end marketing solution, our products were siloed. Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie. This created a huge gap between what we promised and what we delivered—leading to poor product experience and low renewal intent.\n\nAt the same time, I saw a clear industry trend: brands were looking to unify first-party data and deliver personalized experiences across all channels—EDM, SMS, Web, App, and messaging platforms like LINE and WhatsApp. Appier had all the ingredients, but no one was owning the unification vision.\n\nAt the time, I was leading only the BotBonnie product line, with no authority over the other three product teams. Still, I felt responsible for fixing the fragmented user experience. My challenge was to build alignment across product, sales, and executive stakeholders—without formal ownership—and propose a vision that could influence company-wide roadmap and resources.\n\nFirst, I conducted over a dozen customer interviews and internal sessions with sales and customer success leaders to validate the pain points. I synthesized the findings into a three-year platform integration proposal that divided our products into two strategic pillars: **Personalization Cloud** (front-end orchestration) and **Data Cloud** (backend pipelines).\n\nI anticipated pushback around timing and resources, so I proposed a low-risk MVP: a **“Journey Map Builder”** that we could ship in 3 months using only my team. It offered clients a unified UI to design omnichannel campaigns and showcased what integration could look like.\n\nBefore going to the CEO, I aligned with our Chief Strategy Officer—incorporating his feedback and securing early buy-in. When I finally pitched to the CEO, I led with direct client quotes, market data, and a clear plan to phase the vision over time.\n\nThe CEO approved the plan in 15 minutes—and used my slides the next day at our company AMA. I was given cross-product authority to lead the initiative. Three months later, we launched the MVP, recovered **$300K ARR** from churn-risk clients, and received overwhelming feedback from sales and design teams.\n\nSix months later, I was promoted to **Senior Director**, overseeing both BotBonnie and AIQUA. Even after I left, the company continued to build on the same platform architecture I initiated—formally structuring the org around **Personalization Cloud** and **Data Cloud**.",
          "slug": "2025-08-03-unifying-the-customer-journey-from-siloed-tools-to-seamless-platform"
        },
        {
          "title": "Balancing Principles and Diplomacy in Cross-Regional Alignment",
          "summary": "When a roadmap disagreement escalated to the CEO, I resolved the tension by empathizing with regional priorities, offering a collaborative compromise, and preserving both strategic focus and team trust.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022
          ],
          "competencies": [
            "leadership",
            "product_management",
            "international",
            "empathy",
            "negotiation",
            "strategic thinking",
            "communication"
          ],
          "interviewCategories": [
            "Conflict Resolution",
            "Leadership",
            "Collaboration",
            "Stakeholder Management"
          ],
          "questionTypes": [
            "Describe a time you resolved a conflict within your team.",
            "How do you balance competing priorities from different stakeholders?",
            "Can you give an example of how you handled a disagreement with a superior?",
            "What strategies do you use to maintain team trust during challenging situations?"
          ],
          "metrics": [],
          "keywords": [
            "korea",
            "product",
            "sales",
            "leader",
            "strategy",
            "markets",
            "however",
            "roadmap",
            "quarter",
            "wasn",
            "business",
            "leadership",
            "about",
            "disagreement",
            "manager"
          ],
          "starStructure": {
            "situation": "One time I had a disagreement with my manager was at Appier, when I was leading product strategy across multiple regional markets.",
            "task": "",
            "actions": [],
            "results": []
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "One time I had a disagreement with my manager was at Appier, when I was leading product strategy across multiple regional markets.\n\nOur Korea sales leader was pushing hard to prioritize a product request for the Korean market. However, based on our existing roadmap and engineering capacity, I had already communicated — both to him and our CEO — that this would need to wait until the following quarter. The prioritization wasn’t arbitrary; it was aligned with overall business goals and agreed upon with leadership.\n\nHowever, the sales leader felt I was deprioritizing Korea and escalated the issue to the CEO, who then asked me to apologize and try to resolve the situation.\n\nI was initially very frustrated — from my perspective, I had been transparent and collaborative the whole time. I also worried that this would set a precedent that complaints could override product strategy.\n\nBut after cooling down, I tried to understand the bigger picture. The CEO wasn’t necessarily questioning my decision-making, but wanted to maintain momentum in Korea, which was one of our most promising markets.\n\nSo I proactively scheduled a call with the Korea sales leader. I acknowledged the misalignment in expectations, explained the roadmap again, and offered a compromise: we’d begin the **requirement scoping process early**, and **join any client-facing meetings** to support their pitches.\n\nThis helped rebuild trust, and Korea went on to deliver strong sales that quarter — even before the product was fully delivered.\n\nIt reminded me that sometimes leadership isn’t about being right — it’s about **balancing principles with diplomacy**, and finding solutions that move the business forward.",
          "slug": "2025-08-04-balancing-principles-and-diplomacy-in-cross-regional-alignment"
        },
        {
          "title": "Betting on Instagram: A Strategic Pivot for Market Entry",
          "summary": "By challenging the original roadmap and leading a rapid pivot to Instagram Messaging automation, I enabled a differentiated go-to-market strategy in Japan that won enterprise deals and positioned us as an early mover.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2021
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "growth",
            "technical",
            "Data Analysis",
            "Market Research",
            "Stakeholder Management",
            "Negotiation",
            "Cross-Functional Collaboration"
          ],
          "interviewCategories": [
            "Leadership",
            "Strategic Thinking",
            "Problem Solving",
            "Adaptability",
            "Innovation"
          ],
          "questionTypes": [
            "Describe a time you had to pivot a project strategy.",
            "How do you approach data-driven decision making?",
            "Can you give an example of how you led a team through a significant change?",
            "What steps do you take to evaluate market opportunities?",
            "How do you handle competing priorities in product management?"
          ],
          "metrics": [
            "50"
          ],
          "keywords": [
            "instagram",
            "japan",
            "automation",
            "market",
            "product",
            "messaging",
            "whether",
            "integration",
            "pivot",
            "sales",
            "deals",
            "launch",
            "month",
            "within",
            "enterprise"
          ],
          "starStructure": {
            "situation": "When Facebook released the Instagram Messaging API, we were debating whether to pause our ongoing product roadmap to prioritize Instagram automation. Our CEO preferred focusing on cross-product integration to support expansion in Japan.",
            "task": "",
            "actions": [],
            "results": [
              "50"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "When Facebook released the Instagram Messaging API, we were debating whether to pause our ongoing product roadmap to prioritize Instagram automation. Our CEO preferred focusing on cross-product integration to support expansion in Japan.\n\nAs the product lead, I wanted to evaluate whether reprioritizing to Instagram would be a smarter strategic move—and if so, convince leadership to pivot the plan.\n\nI gathered data from multiple sources:\n\n*   Market reports showed Instagram had 50% market penetration in Japan—behind only LINE and YouTube\n    \n*   Internal sales call notes revealed we were losing deals in Japan to pricing competition, with little differentiation\n    \n*   No competitors were offering Instagram Messaging-based automation yet\n    \n*   Our engineers estimated we could launch an MVP in under one month\n    \n\nI synthesized these insights and proposed a shift in focus—launch Instagram automation first to create a differentiated market entry strategy, and use that traction to expand into broader platform integration later.\n\nThe CEO agreed to pivot. Within a month, we launched three marketing automation scenarios for Instagram and enabled the Japan sales team to go to market with something truly novel. The feedback was very positive—enterprise clients were excited to test new engagement strategies. Within a few months, we closed several key enterprise deals, establishing BotBonnie as an early mover in Japan.",
          "slug": "2025-08-04-betting-on-instagram-a-strategic-pivot-for-market-entry"
        },
        {
          "title": "Bridging Cultures to Deliver Under Pressure",
          "summary": "Faced with timeline conflict on a cross-functional MVP, I defused tension by aligning personal incentives, reshaping scope, and building trust—resulting in on-time delivery, $300K in recovered revenue, and stronger cross-team collaboration.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "crisis_management",
            "growth",
            "technical",
            "empathy",
            "negotiation",
            "communication",
            "strategic thinking",
            "relationship building"
          ],
          "interviewCategories": [
            "Conflict Resolution",
            "Team Collaboration",
            "Leadership",
            "Adaptability",
            "Stakeholder Management"
          ],
          "questionTypes": [
            "Describe a time you resolved a conflict within a team.",
            "How do you handle tight deadlines with cross-functional teams?",
            "Can you provide an example of how you aligned team members with different perspectives?",
            "What strategies do you use to build trust among team members?",
            "Tell me about a time you had to adapt your approach to meet project goals."
          ],
          "metrics": [
            "$300K",
            "3",
            "2",
            "300"
          ],
          "keywords": [
            "team",
            "product",
            "estimates",
            "during",
            "strong",
            "shared",
            "about",
            "cross",
            "engineers",
            "different",
            "lines",
            "botbonnie",
            "tight",
            "three",
            "deadline"
          ],
          "starStructure": {
            "situation": "When I led the MVP development of Journey Map at Appier, I formed a new cross-functional team with engineers from two different product lines—BotBonnie (my original team) and another internal product group. We had a tight three-month deadline. The engineering manager and I had broken down the MVP scope into tasks and asked each engineer to estimate their time.",
            "task": "",
            "actions": [],
            "results": [
              "$300K",
              "3",
              "2",
              "300"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "When I led the MVP development of Journey Map at Appier, I formed a new cross-functional team with engineers from two different product lines—BotBonnie (my original team) and another internal product group. We had a tight three-month deadline. The engineering manager and I had broken down the MVP scope into tasks and asked each engineer to estimate their time.\n\nWhile the BotBonnie engineers gave estimates in line with expectations, one engineer from the other team estimated timelines that were 3x longer for tasks of similar complexity. During the planning meeting, he openly criticized the timeline as unrealistic and voiced strong resistance. This was more than just a difference in estimates—it revealed deeper cultural misalignment between teams.\n\nI first acknowledged his concerns and paused the meeting, promising to reassess the scope and timelines. The next day, I invited him to lunch outside office to understand his perspective.\n\nThrough the conversation, I learned his performance was evaluated heavily based on delivery completeness, lack of bugs, and timely execution—which made him risk-averse under our tight deadline. He worried that speed would come at the cost of quality.\n\nI shared the broader purpose of this MVP: to validate a new cross-product vision, demonstrate our ability to move fast, and rebuild trust with our executive team and customers. I emphasized that this was not about perfection, but velocity and iteration.\n\nTo support him, I made three commitments:\n\n1.  I spoke with his manager to align on performance criteria and assured him that I would take responsibility for risks during pilot testing.\n    \n2.  We re-scoped the MVP to separate “must-haves” from “nice-to-haves,” balancing ambition with feasibility.\n    \n3.  I promised to amplify the team’s impact and visibility, so their effort would be recognized beyond just delivery.\n    \n\nIn return, he agreed to re-evaluate the estimates with this new context and became an enthusiastic contributor to the team.\n\nWe successfully launched the MVP on time. During the beta phase, we recovered over $300K in ARR from churn-risk clients. Many leaders in the company, initially skeptical of our timeline, became strong supporters. I was later promoted to lead both product lines and continued scaling the platform.\n\nThis experience taught me that resolving conflict isn’t about “winning”—it’s about understanding what drives the other person and co-creating a shared goal.\n\nIt also reinforced my belief that building a high-performing team across different cultures requires more than just processes—it requires shared goals, psychological safety, and strong personal alignment.",
          "slug": "2025-08-04-bridging-cultures-to-deliver-under-pressure"
        },
        {
          "title": "Designing for the “Aha” Moment in Onboarding",
          "summary": "By streamlining onboarding into a goal-driven, in-flow experience, I increased chatbot publication by 20% and helped users reach product value faster—boosting both activation and retention.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2020
          ],
          "competencies": [
            "product_management",
            "growth",
            "technical",
            "culture_building",
            "data_analysis",
            "user_experience_design",
            "strategic_planning",
            "collaboration"
          ],
          "interviewCategories": [
            "Problem Solving",
            "Leadership",
            "Innovation",
            "User Experience"
          ],
          "questionTypes": [
            "Describe a time when you improved a process.",
            "How do you approach user feedback in product design?",
            "Can you give an example of a successful A/B test you conducted?",
            "What strategies do you use to enhance user engagement?"
          ],
          "metrics": [
            "20% increase",
            "20"
          ],
          "keywords": [
            "users",
            "onboarding",
            "flow",
            "steps",
            "published",
            "drop",
            "test",
            "registration",
            "botbonnie",
            "trying",
            "grow",
            "north",
            "star",
            "metric",
            "number"
          ],
          "starStructure": {
            "situation": "At BotBonnie, we were trying to grow our North Star metric: the number of active chatbots published on the platform. We believed that if users quickly got into our visual no-code builder and started creating flows, they would hit their “aha” moment and stick around.",
            "task": "We needed to improve this flow to boost activation and retention",
            "actions": [],
            "results": [
              "20% increase",
              "20"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "At BotBonnie, we were trying to grow our North Star metric: the number of active chatbots published on the platform. We believed that if users quickly got into our visual no-code builder and started creating flows, they would hit their “aha” moment and stick around.\n\nHowever, data from our onboarding funnel showed a sharp drop-off—many users were not completing key steps like designing a flow or connecting to messaging channels like Facebook or LINE. Most never published a bot. We needed to improve this flow to boost activation and retention.\n\nWe revisited our onboarding design and ran an A/B test.\n\nIn the new version, instead of having users go through multiple steps across different pages, we guided them to create a simple bot right inside the registration flow. They could select a channel, test the conversation, and publish—all within one screen and under three clicks per step.\n\nAlthough it slightly increased time spent in onboarding, the steps felt more goal-oriented and provided quicker feedback.\n\nThe new onboarding flow led to a 20% increase in bot publication, with no drop in registration completion. It was a small but high-leverage improvement that helped more users reach meaningful product value faster.",
          "slug": "2025-08-04-designing-for-the-aha-moment-in-onboarding"
        },
        {
          "title": "From Engineer to Enterprise Leader: The Journey Behind BotBonnie",
          "summary": "Building BotBonnie from scratch to $2M ARR and seeing it acquired was a milestone, but the real success was growing into a strategic leader who shaped product vision, built lasting teams, and created long-term impact across markets.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2016,
            2021
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "growth",
            "international",
            "strategic planning",
            "cross-functional collaboration",
            "market analysis",
            "cultural adaptability",
            "mentorship"
          ],
          "interviewCategories": [
            "Leadership",
            "Teamwork",
            "Adaptability",
            "Strategic Thinking",
            "Problem Solving"
          ],
          "questionTypes": [
            "Can you describe a time when you had to lead a team through a significant change?",
            "How do you approach building a product that meets market needs?",
            "What strategies do you use to foster team growth and development?",
            "Describe a challenging situation you faced during your tenure and how you overcame it.",
            "How do you balance technical skills with leadership responsibilities?"
          ],
          "metrics": [
            "$2M",
            "2M ARR",
            "2"
          ],
          "keywords": [
            "being",
            "team",
            "building",
            "botbonnie",
            "product",
            "appier",
            "through",
            "acquisition",
            "leadership",
            "most",
            "started",
            "still",
            "helped",
            "company",
            "part"
          ],
          "starStructure": {
            "situation": "My greatest professional success so far is building BotBonnie from the ground up, scaling it to $2M ARR, and eventually joining Appier through acquisition. But more than the business result, it’s the personal transformation and leadership growth that I’m most proud of.",
            "task": "I had to identify the right product-market fit, navigate competition, pitch investors and clients, and lead a cross-functional team through both failures and breakthroughs",
            "actions": [],
            "results": [
              "$2M",
              "2M ARR",
              "2"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "My greatest professional success so far is building BotBonnie from the ground up, scaling it to $2M ARR, and eventually joining Appier through acquisition. But more than the business result, it’s the personal transformation and leadership growth that I’m most proud of.\n\nWhen we started BotBonnie, I was still very much an engineer at heart—I loved building things. But as we grew, I realized that being a founder meant shifting from being a maker to being a strategist, team builder, and communicator.\n\nI had to identify the right product-market fit, navigate competition, pitch investors and clients, and lead a cross-functional team through both failures and breakthroughs.\n\nAfter being acquired by Appier, I stayed on and helped integrate BotBonnie into a broader enterprise suite. That came with its own set of challenges: adapting to a different company culture, building credibility internally, and helping my team thrive in a new environment. Over time, I earned the trust to drive platform strategy across two product lines, and helped scale the solution into markets like Japan and Korea.\n\nLooking back, the most meaningful part isn’t the acquisition or the ARR. It’s seeing team members grow into new leadership roles, seeing our product evolve into part of a public company’s long-term roadmap, and knowing that the vision we started with is still creating value years later.",
          "slug": "2025-08-04-from-engineer-to-enterprise-leader-the-journey-behind-botbonnie"
        },
        {
          "title": "Managing Risk Through Empathy and Alignment",
          "summary": "By uncovering the root of team resistance and aligning expectations across functions, I kept our high-stakes MVP on track—delivering on time, recovering $300K in ARR, and strengthening team cohesion.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022,
            2024
          ],
          "competencies": [
            "leadership",
            "product_management",
            "growth",
            "culture_building",
            "empathy",
            "communication",
            "stakeholder management",
            "strategic thinking",
            "adaptability"
          ],
          "interviewCategories": [
            "Leadership",
            "Conflict Resolution",
            "Team Collaboration",
            "Risk Management",
            "Change Management"
          ],
          "questionTypes": [
            "Describe a time when you had to manage a conflict within a team.",
            "How do you handle resistance from team members?",
            "Can you give an example of how you aligned a cross-functional team towards a common goal?",
            "What strategies do you use to manage project risks?",
            "Tell me about a time you had to deliver a project under a tight deadline."
          ],
          "metrics": [
            "$300K",
            "within 3 months",
            "3",
            "300"
          ],
          "keywords": [
            "team",
            "risk",
            "timeline",
            "quality",
            "impact",
            "leading",
            "cross",
            "functional",
            "deliver",
            "journey",
            "within",
            "months",
            "included",
            "engineers",
            "different"
          ],
          "starStructure": {
            "situation": "I was leading a cross-functional team to deliver the MVP of Journey Map within 3 months. The team included engineers from two very different product lines, each with their own working culture.",
            "task": "",
            "actions": [],
            "results": [
              "$300K",
              "within 3 months",
              "3",
              "300"
            ]
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "I was leading a cross-functional team to deliver the MVP of Journey Map within 3 months. The team included engineers from two very different product lines, each with their own working culture.\n\nEarly in planning, we encountered a major risk. One engineer estimated timelines that were 3x longer than others for similar tasks. He believed the timeline was unrealistic and feared it would compromise code quality—due to how his performance was measured, he was hesitant to cut corners or move fast.\n\nI identified several risks: timeline delays, quality issues, team morale, and internal credibility.\n\nTo address them, I:\n\n*   Took the time to understand the root cause behind his resistance by having a one-on-one lunch\n    \n*   Re-scoped the MVP to distinguish “must-have” and “nice-to-have” features\n    \n*   Spoke directly with his manager to align on evaluation expectations and assured I would take ownership of pilot-phase bugs\n    \n*   Reframed the goal of this MVP to focus on iteration speed and customer impact, not perfection\n    \n*   Positioned the project as high-impact to increase recognition and motivation across the team\n    \n\nWe launched the MVP on time, recovered $300K in ARR from churn-risk customers, and earned strong support from execs who were initially skeptical.\n\nThe experience taught me that effective risk management requires not just tactical mitigation, but also empathy, communication, and cultural alignment.",
          "slug": "2025-08-04-managing-risk-through-empathy-and-alignment"
        },
        {
          "title": "Turning a Crisis into a Catalyst for Product Growth",
          "summary": "When a major campaign nearly became a PR disaster, I led a rapid response that uncovered systemic issues, turned a furious client into a success story, and sparked lasting improvements in product design, support, and retention.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2017
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "growth",
            "technical",
            "empathy",
            "communication",
            "analytical thinking",
            "strategic planning",
            "collaboration"
          ],
          "interviewCategories": [
            "Crisis Management",
            "Customer Service",
            "Product Development",
            "Leadership",
            "Problem Solving"
          ],
          "questionTypes": [
            "Describe a time you turned a negative customer experience into a positive outcome.",
            "How do you handle high-pressure situations with clients?",
            "Can you give an example of how you identified and solved a systemic issue?",
            "What steps do you take to ensure customer satisfaction during a crisis?",
            "How do you prioritize tasks when addressing urgent client concerns?"
          ],
          "metrics": [
            "2017",
            "2",
            "3",
            "4"
          ],
          "keywords": [
            "client",
            "high",
            "product",
            "most",
            "chatbot",
            "design",
            "after",
            "user",
            "profile",
            "clients",
            "platform",
            "launch",
            "campaign",
            "success",
            "stories"
          ],
          "starStructure": {
            "situation": "In 2017, one of our most high-profile brand clients used our chatbot platform to launch a major Messenger campaign. They invested significant time and budget into the design and had high expectations, especially after seeing our previous success stories.",
            "task": "As co-founder, I had to address their frustration, uncover the root cause, and prevent churn or reputational damage",
            "actions": [],
            "results": [
              "2017",
              "2",
              "3",
              "4"
            ]
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "In 2017, one of our most high-profile brand clients used our chatbot platform to launch a major Messenger campaign. They invested significant time and budget into the design and had high expectations, especially after seeing our previous success stories.\n\nThree days after launch, the client was furious. The campaign had far fewer user completions than expected. Most users dropped off after the first few messages, and the client claimed the product was misleading and poorly designed. They threatened to publicly discredit us and demanded compensation. As co-founder, I had to address their frustration, uncover the root cause, and prevent churn or reputational damage.\n\nFirst, I responded personally to acknowledge their disappointment, assured them we were taking this seriously, and immediately assigned our CS team to engage directly with the client. I also formed a small task-force team—myself, a PM, and an engineer—to investigate user behavior data.\n\nWithin a few hours, we found that poor conversation design caused user confusion and high drop-off. The core issues were:\n\n*   The client lacked guidance and didn’t know the best practice on how to structure a decision-tree chatbot.\n    \n*   Our product dashboard only reported final results, making it hard to detect UX bottlenecks.\n    \n*   Our internal systems didn’t flag high-profile clients using the self-service platform, so CS hadn’t proactively supported them.\n    \n\nThe next day, I made several decisions:\n\n1.  We created and promoted educational content on conversation design best practices across our customer channels.\n    \n2.  We ideated a heatmap-style visualization tool to help identify drop-off points in chatbot flows.\n    \n3.  We enhanced our internal dashboard to automatically flag high-value self-service accounts, enabling proactive CS outreach.\n    \n4.  I called the client directly to explain the findings, offered CS assistance to rebuild their flow, and shared our roadmap to address the gaps.\n    \n\nWhat started as a potential PR disaster turned into a long-term partnership. The client appreciated our transparency and follow-through, stayed with us, and later became one of our public success stories. Internally, the heatmap and account detection tools became key features that improved product quality and customer retention.\n\nThis experience taught me that difficult customers are often your most valuable. Their frustration is rarely random—it’s a signal that something deeper is broken. By responding with empathy, moving quickly, and thinking systemically, we not only saved the account but improved the product for everyone.",
          "slug": "2025-08-04-turning-a-crisis-into-a-catalyst-for-product-growth"
        },
        {
          "title": "Turning Data Drop-Off into Delight: The Power of Playful Incentives",
          "summary": "To solve low campaign completion rates at BotBonnie, I introduced personalized visual rewards that transformed user flows into engaging experiences—boosting completion to 85%, driving viral sharing, and creating a profitable new product module.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2019
          ],
          "competencies": [
            "product_management",
            "innovation",
            "growth",
            "user_experience_design",
            "data_analysis",
            "marketing_strategy",
            "team_collaboration"
          ],
          "interviewCategories": [
            "Problem Solving",
            "Innovation",
            "Leadership",
            "Collaboration",
            "Results Orientation"
          ],
          "questionTypes": [
            "Can you describe a time when you overcame a significant challenge?",
            "How do you approach innovation in your work?",
            "Tell me about a successful project you led.",
            "How do you motivate your team to achieve goals?",
            "What strategies do you use to improve user engagement?"
          ],
          "metrics": [
            "85",
            "30",
            "9",
            "4"
          ],
          "keywords": [
            "users",
            "burger",
            "campaign",
            "share",
            "example",
            "chatbot",
            "worked",
            "brands",
            "create",
            "user",
            "through",
            "based",
            "flows",
            "engineers",
            "image"
          ],
          "starStructure": {
            "situation": "One example that comes to mind was during my time at BotBonnie, a chatbot marketing platform I co-founded. We worked with brands to create interactive campaigns that collected user preferences through button-based flows.",
            "task": "",
            "actions": [],
            "results": [
              "85",
              "30"
            ]
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "One example that comes to mind was during my time at BotBonnie, a chatbot marketing platform I co-founded. We worked with brands to create interactive campaigns that collected user preferences through button-based flows.\n\nI noticed a consistent issue: many users dropped off before completing these flows, which meant incomplete data for brands and poor campaign performance.\n\nI realized the core problem was a lack of value exchange — we were asking users to give information without offering anything fun or engaging in return. So I proposed a creative solution: what if we could generate **personalized visual rewards** based on user input? Something they’d actually want to share or use.\n\nI worked with our engineers to develop a lightweight image generation module that could dynamically create visuals using users’ choices and attributes, such as their name or selected items. One standout example was a campaign we ran with Shopee and Burger King in Taiwan.\n\nUsers built their own burger by selecting ingredients through a chatbot. At the end, we generated a **custom burger image** for them — which they could either share on social media or **redeem at Burger King for a real custom burger**.\n\nThe results were huge: **hundreds of thousands of users participated**, with an **85% completion rate** and **30% social sharing**. More importantly, what started as a one-off idea evolved into one of our **most profitable and reusable product modules** — engineers could set it up in 30 minutes, and it brought in thousands of dollars in recurring revenue per campaign.\n\nThis experience taught me that innovation doesn’t always require cutting-edge technology — sometimes it’s about rethinking incentives and creating delightful moments that users _want_ to complete and share.\n\n### Campaign Video: [https://www.youtube.com/watch?v=E9c4\\_IgArF0](https://www.youtube.com/watch?v=E9c4_IgArF0)",
          "slug": "2025-08-04-turning-data-drop-off-into-delight-the-power-of-playful-incentives"
        },
        {
          "title": "Building Company Culture from Ground Up",
          "summary": "How I transformed BotBonnie's culture from a vague concept to defined values that achieved 90% retention",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2019,
            2021
          ],
          "competencies": [
            "leadership",
            "product_management",
            "crisis_management",
            "growth",
            "culture_building",
            "strategic_planning",
            "employee_engagement",
            "communication",
            "collaboration",
            "innovation"
          ],
          "interviewCategories": [
            "Leadership and Management",
            "Team Dynamics",
            "Cultural Fit",
            "Problem Solving",
            "Change Management"
          ],
          "questionTypes": [
            "Describe a time you faced a cultural challenge in your team.",
            "How do you approach building a positive company culture?",
            "Can you provide an example of how you improved team morale?",
            "What strategies have you used to retain employees?",
            "How do you handle feedback from team members regarding culture?"
          ],
          "metrics": [
            "8 team members",
            "18 people",
            "2",
            "8",
            "15",
            "20",
            "3",
            "4",
            "5",
            "6"
          ],
          "keywords": [
            "culture",
            "team",
            "company",
            "sessions",
            "grew",
            "morale",
            "work",
            "together",
            "results",
            "botbonnie",
            "members",
            "problem",
            "teammate",
            "directly",
            "needed"
          ],
          "starStructure": {
            "situation": "When BotBonnie grew from 2 founders to 8 team members, I realized we had a culture problem. During a one-on-one, a usually quiet teammate asked me directly: \"What is BotBonnie's company culture?\" I didn't have a good answer, and I could see that morale was declining. That teammate eventually left, which was a wake-up call that I needed to be intentional about culture.\n\nAt that time, the overall morale hit a low point. I even started questioning the meaning of my own work. Company culture became an unsolvable puzzle in my mind, something like an NP-hard problem, as us nerdy engineers would say.",
            "task": "I needed to define and build an authentic company culture that would:\n\n*   Improve team retention and morale\n*   Create shared values and working principles\n*   Scale with our growing team\n*   Actually impact performance, not just be abstract concepts",
            "actions": [],
            "results": [
              "%+ annual employee retention** in a high-churn market",
              "/100 score** in company-wide leadership survey",
              "core values defined** through collaborative process:",
              "Freedom with responsibility",
              "Energetic and joyful work",
              "Creativity",
              "Flexibility and openness to change",
              "Willingness to share"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "# The Challenge\n\nWhen BotBonnie grew from 2 founders to 8 team members, I realized we had a culture problem. During a one-on-one, a usually quiet teammate asked me directly: \"What is BotBonnie's company culture?\" I didn't have a good answer, and I could see that morale was declining. That teammate eventually left, which was a wake-up call that I needed to be intentional about culture.\n\nAt that time, the overall morale hit a low point. I even started questioning the meaning of my own work. Company culture became an unsolvable puzzle in my mind, something like an NP-hard problem, as us nerdy engineers would say.\n\n# What I Had to Do\n\nI needed to define and build an authentic company culture that would:\n\n*   Improve team retention and morale\n*   Create shared values and working principles\n*   Scale with our growing team\n*   Actually impact performance, not just be abstract concepts\n\n# My Approach\n\nI treated this like a product experiment and implemented several initiatives over the course of a year:\n\n## 1\\. Teamwide Personality Interviews\n\n*   Added 15-20 minute sessions where all team members meet candidates\n*   Helped both sides understand each other better\n*   Reduced future friction when working together\n\n## 2\\. Quarterly External Speaker Sessions\n\n*   Invited industry experts to speak to the team\n*   Gave us fresh perspectives and career path insights\n*   Rare chance to see how different roles achieve success\n\n## 3\\. Internal Book Clubs\n\n*   Launched reading groups encouraging everyone to participate\n*   Led discussions and shared takeaways\n*   Created space for self-driven learning and collective growth\n\n## 4\\. Off-site Culture Workshops\n\n*   Organized sessions where teammates reflected on past experiences\n*   Discussed ideal work cultures in small groups\n*   Simple sessions that helped us understand each other and align\n\n## 5\\. \"Everyone is a Product Manager\"\n\n*   Encouraged teammates to create and own tasks\n*   Anyone could raise important problems\n*   Solving each other's blockers became top priority\n\n## 6\\. Focus on Problems, Not Blame\n\n*   Bugs and mistakes are inevitable in software\n*   Focus always on fixing issues and preventing recurrence\n*   Encouraged risk-taking and owned outcomes together\n\n## 7\\. Profit-sharing Program\n\n*   Portion of platform revenue went to company-wide bonuses\n*   Growth recognized as team effort\n*   Every role contributed to outcomes\n\n# The Results\n\nThe results were impressive and measurable:\n\n*   **90%+ annual employee retention** in a high-churn market\n*   **85/100 score** in company-wide leadership survey\n*   **5 core values defined** through collaborative process:\n    *   Freedom with responsibility\n    *   Energetic and joyful work\n    *   Creativity\n    *   Flexibility and openness to change\n    *   Willingness to share\n*   **Sustainable culture framework** that scaled as we grew to 18 people\n*   **Team grew from 8 to 18** in 2 years with less than 3-month onboarding ramp\n\n# Key Insights\n\nThis experience taught me several crucial lessons:\n\n*   Culture can't be imposed top-down; it must be cultivated collaboratively\n*   Small, consistent experiments can have significant cultural impact\n*   Regular reflection and adjustment is essential for cultural evolution\n*   The investment in culture directly correlated with business performance\n*   A team that is aligned and united delivers the best results for customers\n\nThe job of the torchbearer is not necessarily to illuminate the one correct path, but to ignite flames in the hearts of others. With more torches lit, we can explore more paths together.",
          "slug": "culture-building-botbonnie"
        }
      ],
      "personal": [
        {
          "title": "The Cost of One Bad Hire: A Painful Lesson in Team Building",
          "summary": "A rushed hiring decision during a critical client engagement with Audi taught me that even one misaligned hire can damage team morale and trust, shaping how I approach hiring and culture-building ever since.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2018
          ],
          "competencies": [
            "leadership",
            "product_management",
            "crisis_management",
            "culture_building",
            "emotional_intelligence",
            "strategic_thinking",
            "adaptability",
            "team_building",
            "communication"
          ],
          "interviewCategories": [
            "Decision Making",
            "Team Dynamics",
            "Conflict Resolution",
            "Cultural Fit",
            "Leadership Challenges"
          ],
          "questionTypes": [
            "Describe a time when you made a hiring mistake and what you learned from it.",
            "How do you assess cultural fit during the hiring process?",
            "Can you provide an example of how a team member's behavior affected team morale?",
            "What strategies do you use to ensure team alignment and trust?",
            "Tell me about a time you had to manage a difficult situation with a client."
          ],
          "metrics": [],
          "keywords": [
            "team",
            "work",
            "most",
            "audi",
            "pressure",
            "project",
            "high",
            "strong",
            "experience",
            "culture",
            "result",
            "hiring",
            "painful",
            "valuable",
            "failures"
          ],
          "starStructure": {
            "situation": "One of the most painful but valuable failures in my career happened during the early days of BotBonnie.",
            "task": "Eventually, I had to let him go and personally explain the situation to Audi — which was not easy",
            "actions": [],
            "results": []
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "One of the most painful but valuable failures in my career happened during the early days of BotBonnie.\n\nWe were growing fast, had just launched several successful campaigns, and were about to work with a major client — Audi. Under pressure, I urgently needed a project manager to help manage this high-stakes engagement.\n\nWe found a candidate with a strong academic background and banking project management experience. While I noticed a slight mismatch in mindset and culture fit, I ignored my instinct due to time pressure and hired him.\n\nUnfortunately, the result was disastrous. His work was often sloppy, he resisted feedback, and his confrontational attitude disrupted team morale. Over three months, his presence negatively affected the team to the point where we two originally strong members were started to work like him. Eventually, I had to let him go and personally explain the situation to Audi — which was not easy.\n\nThat experience taught me a critical lesson: **in a startup, one bad hire can cost you far more than just productivity — it can affect team culture, trust, and momentum.**\n\nSince then, I’ve treated hiring as one of the most important decisions a founder makes. I invested in a more structured hiring process, involving team fit interviews, values alignment, and trial tasks. As a result, we gradually built a high-performing team that truly shared our vision.",
          "slug": "2025-08-03-the-cost-of-one-bad-hire-a-painful-lesson-in-team-building"
        },
        {
          "title": "Unifying the Customer Journey: From Siloed Tools to Seamless Platform",
          "summary": "Without formal authority, I led a company-wide transformation to unify Appier’s product suite, launching a successful MVP that reversed churn, secured executive buy-in, and reshaped the long-term product architecture.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022,
            2023
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "crisis_management",
            "growth",
            "technical",
            "stakeholder management",
            "customer-centricity",
            "communication",
            "negotiation",
            "visionary thinking"
          ],
          "interviewCategories": [
            "Leadership",
            "Problem Solving",
            "Collaboration",
            "Adaptability",
            "Strategic Thinking"
          ],
          "questionTypes": [
            "Describe a time you led a project without formal authority.",
            "How did you handle resistance when proposing a new initiative?",
            "Can you give an example of how you identified and addressed a customer pain point?",
            "What steps did you take to align cross-functional teams on a vision?",
            "How did you measure the success of your initiative?"
          ],
          "metrics": [
            "$300K",
            "in 3 months",
            "3",
            "15",
            "300"
          ],
          "keywords": [
            "data",
            "product",
            "botbonnie",
            "sales",
            "cloud",
            "clients",
            "across",
            "vision",
            "over",
            "three",
            "company",
            "months",
            "after",
            "appier",
            "cross"
          ],
          "starStructure": {
            "situation": "After Appier acquired my startup BotBonnie, I began sitting in on cross-functional sales pitches and noticed a recurring issue: while we marketed an end-to-end marketing solution, our products were siloed. Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie. This created a huge gap between what we promised and what we delivered—leading to poor product experience and low renewal intent.",
            "task": "Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie",
            "actions": [],
            "results": [
              "$300K",
              "in 3 months",
              "3",
              "15",
              "300"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "After Appier acquired my startup BotBonnie, I began sitting in on cross-functional sales pitches and noticed a recurring issue: while we marketed an end-to-end marketing solution, our products were siloed. Clients had to log into multiple platforms, reconfigure settings, and reconcile inconsistent data across tools like AIQUA and BotBonnie. This created a huge gap between what we promised and what we delivered—leading to poor product experience and low renewal intent.\n\nAt the same time, I saw a clear industry trend: brands were looking to unify first-party data and deliver personalized experiences across all channels—EDM, SMS, Web, App, and messaging platforms like LINE and WhatsApp. Appier had all the ingredients, but no one was owning the unification vision.\n\nAt the time, I was leading only the BotBonnie product line, with no authority over the other three product teams. Still, I felt responsible for fixing the fragmented user experience. My challenge was to build alignment across product, sales, and executive stakeholders—without formal ownership—and propose a vision that could influence company-wide roadmap and resources.\n\nFirst, I conducted over a dozen customer interviews and internal sessions with sales and customer success leaders to validate the pain points. I synthesized the findings into a three-year platform integration proposal that divided our products into two strategic pillars: **Personalization Cloud** (front-end orchestration) and **Data Cloud** (backend pipelines).\n\nI anticipated pushback around timing and resources, so I proposed a low-risk MVP: a **“Journey Map Builder”** that we could ship in 3 months using only my team. It offered clients a unified UI to design omnichannel campaigns and showcased what integration could look like.\n\nBefore going to the CEO, I aligned with our Chief Strategy Officer—incorporating his feedback and securing early buy-in. When I finally pitched to the CEO, I led with direct client quotes, market data, and a clear plan to phase the vision over time.\n\nThe CEO approved the plan in 15 minutes—and used my slides the next day at our company AMA. I was given cross-product authority to lead the initiative. Three months later, we launched the MVP, recovered **$300K ARR** from churn-risk clients, and received overwhelming feedback from sales and design teams.\n\nSix months later, I was promoted to **Senior Director**, overseeing both BotBonnie and AIQUA. Even after I left, the company continued to build on the same platform architecture I initiated—formally structuring the org around **Personalization Cloud** and **Data Cloud**.",
          "slug": "2025-08-03-unifying-the-customer-journey-from-siloed-tools-to-seamless-platform"
        },
        {
          "title": "Bridging Cultures to Deliver Under Pressure",
          "summary": "Faced with timeline conflict on a cross-functional MVP, I defused tension by aligning personal incentives, reshaping scope, and building trust—resulting in on-time delivery, $300K in recovered revenue, and stronger cross-team collaboration.",
          "company": "Appier",
          "role": "Senior Director of Product Management",
          "timeframe": [
            2022
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "crisis_management",
            "growth",
            "technical",
            "empathy",
            "negotiation",
            "communication",
            "strategic thinking",
            "relationship building"
          ],
          "interviewCategories": [
            "Conflict Resolution",
            "Team Collaboration",
            "Leadership",
            "Adaptability",
            "Stakeholder Management"
          ],
          "questionTypes": [
            "Describe a time you resolved a conflict within a team.",
            "How do you handle tight deadlines with cross-functional teams?",
            "Can you provide an example of how you aligned team members with different perspectives?",
            "What strategies do you use to build trust among team members?",
            "Tell me about a time you had to adapt your approach to meet project goals."
          ],
          "metrics": [
            "$300K",
            "3",
            "2",
            "300"
          ],
          "keywords": [
            "team",
            "product",
            "estimates",
            "during",
            "strong",
            "shared",
            "about",
            "cross",
            "engineers",
            "different",
            "lines",
            "botbonnie",
            "tight",
            "three",
            "deadline"
          ],
          "starStructure": {
            "situation": "When I led the MVP development of Journey Map at Appier, I formed a new cross-functional team with engineers from two different product lines—BotBonnie (my original team) and another internal product group. We had a tight three-month deadline. The engineering manager and I had broken down the MVP scope into tasks and asked each engineer to estimate their time.",
            "task": "",
            "actions": [],
            "results": [
              "$300K",
              "3",
              "2",
              "300"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "When I led the MVP development of Journey Map at Appier, I formed a new cross-functional team with engineers from two different product lines—BotBonnie (my original team) and another internal product group. We had a tight three-month deadline. The engineering manager and I had broken down the MVP scope into tasks and asked each engineer to estimate their time.\n\nWhile the BotBonnie engineers gave estimates in line with expectations, one engineer from the other team estimated timelines that were 3x longer for tasks of similar complexity. During the planning meeting, he openly criticized the timeline as unrealistic and voiced strong resistance. This was more than just a difference in estimates—it revealed deeper cultural misalignment between teams.\n\nI first acknowledged his concerns and paused the meeting, promising to reassess the scope and timelines. The next day, I invited him to lunch outside office to understand his perspective.\n\nThrough the conversation, I learned his performance was evaluated heavily based on delivery completeness, lack of bugs, and timely execution—which made him risk-averse under our tight deadline. He worried that speed would come at the cost of quality.\n\nI shared the broader purpose of this MVP: to validate a new cross-product vision, demonstrate our ability to move fast, and rebuild trust with our executive team and customers. I emphasized that this was not about perfection, but velocity and iteration.\n\nTo support him, I made three commitments:\n\n1.  I spoke with his manager to align on performance criteria and assured him that I would take responsibility for risks during pilot testing.\n    \n2.  We re-scoped the MVP to separate “must-haves” from “nice-to-haves,” balancing ambition with feasibility.\n    \n3.  I promised to amplify the team’s impact and visibility, so their effort would be recognized beyond just delivery.\n    \n\nIn return, he agreed to re-evaluate the estimates with this new context and became an enthusiastic contributor to the team.\n\nWe successfully launched the MVP on time. During the beta phase, we recovered over $300K in ARR from churn-risk clients. Many leaders in the company, initially skeptical of our timeline, became strong supporters. I was later promoted to lead both product lines and continued scaling the platform.\n\nThis experience taught me that resolving conflict isn’t about “winning”—it’s about understanding what drives the other person and co-creating a shared goal.\n\nIt also reinforced my belief that building a high-performing team across different cultures requires more than just processes—it requires shared goals, psychological safety, and strong personal alignment.",
          "slug": "2025-08-04-bridging-cultures-to-deliver-under-pressure"
        },
        {
          "title": "From Engineer to Enterprise Leader: The Journey Behind BotBonnie",
          "summary": "Building BotBonnie from scratch to $2M ARR and seeing it acquired was a milestone, but the real success was growing into a strategic leader who shaped product vision, built lasting teams, and created long-term impact across markets.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2016,
            2021
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "growth",
            "international",
            "strategic planning",
            "cross-functional collaboration",
            "market analysis",
            "cultural adaptability",
            "mentorship"
          ],
          "interviewCategories": [
            "Leadership",
            "Teamwork",
            "Adaptability",
            "Strategic Thinking",
            "Problem Solving"
          ],
          "questionTypes": [
            "Can you describe a time when you had to lead a team through a significant change?",
            "How do you approach building a product that meets market needs?",
            "What strategies do you use to foster team growth and development?",
            "Describe a challenging situation you faced during your tenure and how you overcame it.",
            "How do you balance technical skills with leadership responsibilities?"
          ],
          "metrics": [
            "$2M",
            "2M ARR",
            "2"
          ],
          "keywords": [
            "being",
            "team",
            "building",
            "botbonnie",
            "product",
            "appier",
            "through",
            "acquisition",
            "leadership",
            "most",
            "started",
            "still",
            "helped",
            "company",
            "part"
          ],
          "starStructure": {
            "situation": "My greatest professional success so far is building BotBonnie from the ground up, scaling it to $2M ARR, and eventually joining Appier through acquisition. But more than the business result, it’s the personal transformation and leadership growth that I’m most proud of.",
            "task": "I had to identify the right product-market fit, navigate competition, pitch investors and clients, and lead a cross-functional team through both failures and breakthroughs",
            "actions": [],
            "results": [
              "$2M",
              "2M ARR",
              "2"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "My greatest professional success so far is building BotBonnie from the ground up, scaling it to $2M ARR, and eventually joining Appier through acquisition. But more than the business result, it’s the personal transformation and leadership growth that I’m most proud of.\n\nWhen we started BotBonnie, I was still very much an engineer at heart—I loved building things. But as we grew, I realized that being a founder meant shifting from being a maker to being a strategist, team builder, and communicator.\n\nI had to identify the right product-market fit, navigate competition, pitch investors and clients, and lead a cross-functional team through both failures and breakthroughs.\n\nAfter being acquired by Appier, I stayed on and helped integrate BotBonnie into a broader enterprise suite. That came with its own set of challenges: adapting to a different company culture, building credibility internally, and helping my team thrive in a new environment. Over time, I earned the trust to drive platform strategy across two product lines, and helped scale the solution into markets like Japan and Korea.\n\nLooking back, the most meaningful part isn’t the acquisition or the ARR. It’s seeing team members grow into new leadership roles, seeing our product evolve into part of a public company’s long-term roadmap, and knowing that the vision we started with is still creating value years later.",
          "slug": "2025-08-04-from-engineer-to-enterprise-leader-the-journey-behind-botbonnie"
        },
        {
          "title": "Losing Audi — and Winning Them Back",
          "summary": "After losing a key client to a lowball competitor, I led a professional handoff, reflected deeply with my team, and focused on long-term value—ultimately earning back Audi’s trust and renewing the partnership.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2021
          ],
          "competencies": [
            "product_management",
            "innovation",
            "relationship_management",
            "strategic_planning",
            "team_collaboration",
            "communication"
          ],
          "interviewCategories": [
            "Leadership",
            "Problem Solving",
            "Client Relationship Management",
            "Resilience"
          ],
          "questionTypes": [
            "Describe a time you lost a key client and how you handled it.",
            "How do you approach rebuilding trust with a client after a setback?",
            "Can you provide an example of how you managed a difficult negotiation?",
            "What steps do you take to ensure long-term client relationships?"
          ],
          "metrics": [
            "2021"
          ],
          "keywords": [
            "audi",
            "competitor",
            "multi",
            "year",
            "partnership",
            "three",
            "contact",
            "came",
            "client",
            "loss",
            "long",
            "term",
            "value",
            "deal",
            "back"
          ],
          "starStructure": {
            "situation": "In 2021, we were renewing our multi-year partnership with Audi, one of BotBonnie’s first and most iconic enterprise clients. We had worked with them for three years, and they were a big part of our early success story.",
            "task": "",
            "actions": [],
            "results": [
              "2021"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "In 2021, we were renewing our multi-year partnership with Audi, one of BotBonnie’s first and most iconic enterprise clients. We had worked with them for three years, and they were a big part of our early success story.\n\nBut that year, our main contact at Audi left the company, and a new Taiwan GM came in. The renewal discussions became rocky. A competitor came in aggressively with much lower pricing and an unrealistic delivery timeline. We evaluated it carefully and knew that matching their offer would be unsustainable for us. Still, we tried to engage the client, explain the tradeoffs, and express our strong interest in continuing the partnership.\n\nDespite our effort, Audi chose the competitor. It was a tough blow—not only did we lose a key client, but internally, it felt like a personal loss. I gathered the team, and instead of blaming the outcome, we held a postmortem to analyze what went wrong—things like overreliance on a single contact, lack of multi-threading in the relationship, and a need to reframe how we communicated long-term value in a competitive deal.\n\nWe focused our energy on supporting the handoff professionally and doubling down on product innovation to strengthen our positioning.\n\nUnexpectedly, about three months later, Audi reached back out. The competitor had missed deadlines and overpromised. We were invited back in and eventually signed a new deal, regaining their trust.\n\nBut more importantly, the failure taught me not to take customer loyalty for granted, and that even in loss, your professionalism and long-term value can leave a lasting impression.",
          "slug": "2025-08-04-losing-audi-and-winning-them-back"
        },
        {
          "title": "Turning a Crisis into a Catalyst for Product Growth",
          "summary": "When a major campaign nearly became a PR disaster, I led a rapid response that uncovered systemic issues, turned a furious client into a success story, and sparked lasting improvements in product design, support, and retention.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2017
          ],
          "competencies": [
            "leadership",
            "product_management",
            "innovation",
            "growth",
            "technical",
            "empathy",
            "communication",
            "analytical thinking",
            "strategic planning",
            "collaboration"
          ],
          "interviewCategories": [
            "Crisis Management",
            "Customer Service",
            "Product Development",
            "Leadership",
            "Problem Solving"
          ],
          "questionTypes": [
            "Describe a time you turned a negative customer experience into a positive outcome.",
            "How do you handle high-pressure situations with clients?",
            "Can you give an example of how you identified and solved a systemic issue?",
            "What steps do you take to ensure customer satisfaction during a crisis?",
            "How do you prioritize tasks when addressing urgent client concerns?"
          ],
          "metrics": [
            "2017",
            "2",
            "3",
            "4"
          ],
          "keywords": [
            "client",
            "high",
            "product",
            "most",
            "chatbot",
            "design",
            "after",
            "user",
            "profile",
            "clients",
            "platform",
            "launch",
            "campaign",
            "success",
            "stories"
          ],
          "starStructure": {
            "situation": "In 2017, one of our most high-profile brand clients used our chatbot platform to launch a major Messenger campaign. They invested significant time and budget into the design and had high expectations, especially after seeing our previous success stories.",
            "task": "As co-founder, I had to address their frustration, uncover the root cause, and prevent churn or reputational damage",
            "actions": [],
            "results": [
              "2017",
              "2",
              "3",
              "4"
            ]
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "In 2017, one of our most high-profile brand clients used our chatbot platform to launch a major Messenger campaign. They invested significant time and budget into the design and had high expectations, especially after seeing our previous success stories.\n\nThree days after launch, the client was furious. The campaign had far fewer user completions than expected. Most users dropped off after the first few messages, and the client claimed the product was misleading and poorly designed. They threatened to publicly discredit us and demanded compensation. As co-founder, I had to address their frustration, uncover the root cause, and prevent churn or reputational damage.\n\nFirst, I responded personally to acknowledge their disappointment, assured them we were taking this seriously, and immediately assigned our CS team to engage directly with the client. I also formed a small task-force team—myself, a PM, and an engineer—to investigate user behavior data.\n\nWithin a few hours, we found that poor conversation design caused user confusion and high drop-off. The core issues were:\n\n*   The client lacked guidance and didn’t know the best practice on how to structure a decision-tree chatbot.\n    \n*   Our product dashboard only reported final results, making it hard to detect UX bottlenecks.\n    \n*   Our internal systems didn’t flag high-profile clients using the self-service platform, so CS hadn’t proactively supported them.\n    \n\nThe next day, I made several decisions:\n\n1.  We created and promoted educational content on conversation design best practices across our customer channels.\n    \n2.  We ideated a heatmap-style visualization tool to help identify drop-off points in chatbot flows.\n    \n3.  We enhanced our internal dashboard to automatically flag high-value self-service accounts, enabling proactive CS outreach.\n    \n4.  I called the client directly to explain the findings, offered CS assistance to rebuild their flow, and shared our roadmap to address the gaps.\n    \n\nWhat started as a potential PR disaster turned into a long-term partnership. The client appreciated our transparency and follow-through, stayed with us, and later became one of our public success stories. Internally, the heatmap and account detection tools became key features that improved product quality and customer retention.\n\nThis experience taught me that difficult customers are often your most valuable. Their frustration is rarely random—it’s a signal that something deeper is broken. By responding with empathy, moving quickly, and thinking systemically, we not only saved the account but improved the product for everyone.",
          "slug": "2025-08-04-turning-a-crisis-into-a-catalyst-for-product-growth"
        },
        {
          "title": "Turning Data Drop-Off into Delight: The Power of Playful Incentives",
          "summary": "To solve low campaign completion rates at BotBonnie, I introduced personalized visual rewards that transformed user flows into engaging experiences—boosting completion to 85%, driving viral sharing, and creating a profitable new product module.",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2019
          ],
          "competencies": [
            "product_management",
            "innovation",
            "growth",
            "user_experience_design",
            "data_analysis",
            "marketing_strategy",
            "team_collaboration"
          ],
          "interviewCategories": [
            "Problem Solving",
            "Innovation",
            "Leadership",
            "Collaboration",
            "Results Orientation"
          ],
          "questionTypes": [
            "Can you describe a time when you overcame a significant challenge?",
            "How do you approach innovation in your work?",
            "Tell me about a successful project you led.",
            "How do you motivate your team to achieve goals?",
            "What strategies do you use to improve user engagement?"
          ],
          "metrics": [
            "85",
            "30",
            "9",
            "4"
          ],
          "keywords": [
            "users",
            "burger",
            "campaign",
            "share",
            "example",
            "chatbot",
            "worked",
            "brands",
            "create",
            "user",
            "through",
            "based",
            "flows",
            "engineers",
            "image"
          ],
          "starStructure": {
            "situation": "One example that comes to mind was during my time at BotBonnie, a chatbot marketing platform I co-founded. We worked with brands to create interactive campaigns that collected user preferences through button-based flows.",
            "task": "",
            "actions": [],
            "results": [
              "85",
              "30"
            ]
          },
          "impactLevel": "medium",
          "seniorityLevel": "executive",
          "content": "One example that comes to mind was during my time at BotBonnie, a chatbot marketing platform I co-founded. We worked with brands to create interactive campaigns that collected user preferences through button-based flows.\n\nI noticed a consistent issue: many users dropped off before completing these flows, which meant incomplete data for brands and poor campaign performance.\n\nI realized the core problem was a lack of value exchange — we were asking users to give information without offering anything fun or engaging in return. So I proposed a creative solution: what if we could generate **personalized visual rewards** based on user input? Something they’d actually want to share or use.\n\nI worked with our engineers to develop a lightweight image generation module that could dynamically create visuals using users’ choices and attributes, such as their name or selected items. One standout example was a campaign we ran with Shopee and Burger King in Taiwan.\n\nUsers built their own burger by selecting ingredients through a chatbot. At the end, we generated a **custom burger image** for them — which they could either share on social media or **redeem at Burger King for a real custom burger**.\n\nThe results were huge: **hundreds of thousands of users participated**, with an **85% completion rate** and **30% social sharing**. More importantly, what started as a one-off idea evolved into one of our **most profitable and reusable product modules** — engineers could set it up in 30 minutes, and it brought in thousands of dollars in recurring revenue per campaign.\n\nThis experience taught me that innovation doesn’t always require cutting-edge technology — sometimes it’s about rethinking incentives and creating delightful moments that users _want_ to complete and share.\n\n### Campaign Video: [https://www.youtube.com/watch?v=E9c4\\_IgArF0](https://www.youtube.com/watch?v=E9c4_IgArF0)",
          "slug": "2025-08-04-turning-data-drop-off-into-delight-the-power-of-playful-incentives"
        },
        {
          "title": "Building Company Culture from Ground Up",
          "summary": "How I transformed BotBonnie's culture from a vague concept to defined values that achieved 90% retention",
          "company": "BotBonnie",
          "role": "Co-Founder & CEO",
          "timeframe": [
            2019,
            2021
          ],
          "competencies": [
            "leadership",
            "product_management",
            "crisis_management",
            "growth",
            "culture_building",
            "strategic_planning",
            "employee_engagement",
            "communication",
            "collaboration",
            "innovation"
          ],
          "interviewCategories": [
            "Leadership and Management",
            "Team Dynamics",
            "Cultural Fit",
            "Problem Solving",
            "Change Management"
          ],
          "questionTypes": [
            "Describe a time you faced a cultural challenge in your team.",
            "How do you approach building a positive company culture?",
            "Can you provide an example of how you improved team morale?",
            "What strategies have you used to retain employees?",
            "How do you handle feedback from team members regarding culture?"
          ],
          "metrics": [
            "8 team members",
            "18 people",
            "2",
            "8",
            "15",
            "20",
            "3",
            "4",
            "5",
            "6"
          ],
          "keywords": [
            "culture",
            "team",
            "company",
            "sessions",
            "grew",
            "morale",
            "work",
            "together",
            "results",
            "botbonnie",
            "members",
            "problem",
            "teammate",
            "directly",
            "needed"
          ],
          "starStructure": {
            "situation": "When BotBonnie grew from 2 founders to 8 team members, I realized we had a culture problem. During a one-on-one, a usually quiet teammate asked me directly: \"What is BotBonnie's company culture?\" I didn't have a good answer, and I could see that morale was declining. That teammate eventually left, which was a wake-up call that I needed to be intentional about culture.\n\nAt that time, the overall morale hit a low point. I even started questioning the meaning of my own work. Company culture became an unsolvable puzzle in my mind, something like an NP-hard problem, as us nerdy engineers would say.",
            "task": "I needed to define and build an authentic company culture that would:\n\n*   Improve team retention and morale\n*   Create shared values and working principles\n*   Scale with our growing team\n*   Actually impact performance, not just be abstract concepts",
            "actions": [],
            "results": [
              "%+ annual employee retention** in a high-churn market",
              "/100 score** in company-wide leadership survey",
              "core values defined** through collaborative process:",
              "Freedom with responsibility",
              "Energetic and joyful work",
              "Creativity",
              "Flexibility and openness to change",
              "Willingness to share"
            ]
          },
          "impactLevel": "high",
          "seniorityLevel": "executive",
          "content": "# The Challenge\n\nWhen BotBonnie grew from 2 founders to 8 team members, I realized we had a culture problem. During a one-on-one, a usually quiet teammate asked me directly: \"What is BotBonnie's company culture?\" I didn't have a good answer, and I could see that morale was declining. That teammate eventually left, which was a wake-up call that I needed to be intentional about culture.\n\nAt that time, the overall morale hit a low point. I even started questioning the meaning of my own work. Company culture became an unsolvable puzzle in my mind, something like an NP-hard problem, as us nerdy engineers would say.\n\n# What I Had to Do\n\nI needed to define and build an authentic company culture that would:\n\n*   Improve team retention and morale\n*   Create shared values and working principles\n*   Scale with our growing team\n*   Actually impact performance, not just be abstract concepts\n\n# My Approach\n\nI treated this like a product experiment and implemented several initiatives over the course of a year:\n\n## 1\\. Teamwide Personality Interviews\n\n*   Added 15-20 minute sessions where all team members meet candidates\n*   Helped both sides understand each other better\n*   Reduced future friction when working together\n\n## 2\\. Quarterly External Speaker Sessions\n\n*   Invited industry experts to speak to the team\n*   Gave us fresh perspectives and career path insights\n*   Rare chance to see how different roles achieve success\n\n## 3\\. Internal Book Clubs\n\n*   Launched reading groups encouraging everyone to participate\n*   Led discussions and shared takeaways\n*   Created space for self-driven learning and collective growth\n\n## 4\\. Off-site Culture Workshops\n\n*   Organized sessions where teammates reflected on past experiences\n*   Discussed ideal work cultures in small groups\n*   Simple sessions that helped us understand each other and align\n\n## 5\\. \"Everyone is a Product Manager\"\n\n*   Encouraged teammates to create and own tasks\n*   Anyone could raise important problems\n*   Solving each other's blockers became top priority\n\n## 6\\. Focus on Problems, Not Blame\n\n*   Bugs and mistakes are inevitable in software\n*   Focus always on fixing issues and preventing recurrence\n*   Encouraged risk-taking and owned outcomes together\n\n## 7\\. Profit-sharing Program\n\n*   Portion of platform revenue went to company-wide bonuses\n*   Growth recognized as team effort\n*   Every role contributed to outcomes\n\n# The Results\n\nThe results were impressive and measurable:\n\n*   **90%+ annual employee retention** in a high-churn market\n*   **85/100 score** in company-wide leadership survey\n*   **5 core values defined** through collaborative process:\n    *   Freedom with responsibility\n    *   Energetic and joyful work\n    *   Creativity\n    *   Flexibility and openness to change\n    *   Willingness to share\n*   **Sustainable culture framework** that scaled as we grew to 18 people\n*   **Team grew from 8 to 18** in 2 years with less than 3-month onboarding ramp\n\n# Key Insights\n\nThis experience taught me several crucial lessons:\n\n*   Culture can't be imposed top-down; it must be cultivated collaboratively\n*   Small, consistent experiments can have significant cultural impact\n*   Regular reflection and adjustment is essential for cultural evolution\n*   The investment in culture directly correlated with business performance\n*   A team that is aligned and united delivers the best results for customers\n\nThe job of the torchbearer is not necessarily to illuminate the one correct path, but to ignite flames in the hearts of others. With more torches lit, we can explore more paths together.",
          "slug": "culture-building-botbonnie"
        }
      ]
    },
    "total_metrics_extracted": 38,
    "total_competencies_found": 43
  }
}